import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:share_plus/share_plus.dart';
import 'package:wish_message_app/features/common/read_sms.dart';

class LoveSms extends StatelessWidget {
  const LoveSms({super.key});

  @override
  Widget build(BuildContext context) {
    return Padding(
      padding: const EdgeInsets.all(16),
      child: Column(
        children: [
          ReadSms(
            message:
                'কারো কাছ থেকে গভীর ভালোবাসা পাওয়া তোমাকে শক্তি দেয়, আর কাউকে গভীর ভালোবাসা তোমাকে সাহস দেয়।',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'কারো কাছ থেকে গভীর ভালোবাসা পাওয়া তোমাকে শক্তি দেয়, আর কাউকে গভীর ভালোবাসা তোমাকে সাহস দেয়।',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'কারো কাছ থেকে গভীর ভালোবাসা পাওয়া তোমাকে শক্তি দেয়, আর কাউকে গভীর ভালোবাসা তোমাকে সাহস দেয়।',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমাকে আমার জীবনে পেয়ে আমি সত্যিই ধন্য। আমি তোমাকে অনেক ভালোবাসি, প্রিয়তমা!',
            favoriteButton: () {},
            shareButton: () {
              Share.share('তোমাকে আমার জীবনে পেয়ে আমি সত্যিই ধন্য। আমি তোমাকে অনেক ভালোবাসি, প্রিয়তমা!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমাকে আমার জীবনে পেয়ে আমি সত্যিই ধন্য। আমি তোমাকে অনেক ভালোবাসি, প্রিয়তমা!'));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমরা একে অপরের থেকে যত দূরেই থাকি না কেন, জেনে রেখো আমি সবসময় তোমারই থাকব। তোমাকে ভালোবাসি, সোনা। 💗',
            favoriteButton: () {},
            shareButton: () {
              Share.share('আমরা একে অপরের থেকে যত দূরেই থাকি না কেন, জেনে রেখো আমি সবসময় তোমারই থাকব। তোমাকে ভালোবাসি, সোনা। 💗');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমরা একে অপরের থেকে যত দূরেই থাকি না কেন, জেনে রেখো আমি সবসময় তোমারই থাকব। তোমাকে ভালোবাসি, সোনা। 💗'));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'তোমার প্রতি আমার ভালোবাসা এই জীবনে কখনো শেষ হবে না। আমিও তোমার সাথে আমার পরকাল কাটাতে চাই ❤️🥰😘',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'তোমার প্রতি আমার ভালোবাসা এই জীবনে কখনো শেষ হবে না। আমিও তোমার সাথে আমার পরকাল কাটাতে চাই ❤️🥰😘',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'তোমার প্রতি আমার ভালোবাসা এই জীবনে কখনো শেষ হবে না। আমিও তোমার সাথে আমার পরকাল কাটাতে চাই ❤️🥰😘',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'তুমি কি জানো আমি একটা জিনিস খুব পছন্দ করি? সেটা হলো তোমার ভালোবাসা এবং তুমি আমার 🥰',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'তুমি কি জানো আমি একটা জিনিস খুব পছন্দ করি? সেটা হলো তোমার ভালোবাসা এবং তুমি আমার 🥰',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'তুমি কি জানো আমি একটা জিনিস খুব পছন্দ করি? সেটা হলো তোমার ভালোবাসা এবং তুমি আমার 🥰',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'যাই ঘটে থাকুক না কেন। তুমি যা করে থাকো না কেন। তুমি যা করবে না কেন। আমি তোমাকে সবসময় ভালোবাসবো। আজ, আগামীকাল এবং চিরকাল তোমাকে আমার জীবনে চাই 🥰',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'যাই ঘটে থাকুক না কেন। তুমি যা করে থাকো না কেন। তুমি যা করবে না কেন। আমি তোমাকে সবসময় ভালোবাসবো। আজ, আগামীকাল এবং চিরকাল তোমাকে আমার জীবনে চাই 🥰',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'যাই ঘটে থাকুক না কেন। তুমি যা করে থাকো না কেন। তুমি যা করবে না কেন। আমি তোমাকে সবসময় ভালোবাসবো। আজ, আগামীকাল এবং চিরকাল তোমাকে আমার জীবনে চাই 🥰',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'দিনের শেষে আমরা যেভাবে বাড়ি ফিরে সান্ত্বনা পাই, আমি সবসময় তোমার কোলে ফিরে আসব। আমার কাছে, এটি পৃথিবীর সবচেয়ে শান্তিপূর্ণ জায়গা।',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'দিনের শেষে আমরা যেভাবে বাড়ি ফিরে সান্ত্বনা পাই, আমি সবসময় তোমার কোলে ফিরে আসব। আমার কাছে, এটি পৃথিবীর সবচেয়ে শান্তিপূর্ণ জায়গা।',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'দিনের শেষে আমরা যেভাবে বাড়ি ফিরে সান্ত্বনা পাই, আমি সবসময় তোমার কোলে ফিরে আসব। আমার কাছে, এটি পৃথিবীর সবচেয়ে শান্তিপূর্ণ জায়গা।',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'তোমার প্রতি আমার ভালোবাসা সমুদ্রের চেয়েও গভীর এবং মহাবিশ্বের চেয়েও মহান, এটি পরিমাপ করা যায় না এবং এর কোন শেষ নেই।',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'তোমার প্রতি আমার ভালোবাসা সমুদ্রের চেয়েও গভীর এবং মহাবিশ্বের চেয়েও মহান, এটি পরিমাপ করা যায় না এবং এর কোন শেষ নেই।',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'তোমার প্রতি আমার ভালোবাসা সমুদ্রের চেয়েও গভীর এবং মহাবিশ্বের চেয়েও মহান, এটি পরিমাপ করা যায় না এবং এর কোন শেষ নেই।',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'আমি তোমাকে ভালোবাসি, শুধু এই কারণে নয় যে তুমি আমাকে বোঝো, বরং এই কারণে যে আমার হৃদয় তোমার সাথে যোগাযোগ করতে পারে, তুমি আমার থেকে যত দূরেই থাকো না কেন।',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'আমি তোমাকে ভালোবাসি, শুধু এই কারণে নয় যে তুমি আমাকে বোঝো, বরং এই কারণে যে আমার হৃদয় তোমার সাথে যোগাযোগ করতে পারে, তুমি আমার থেকে যত দূরেই থাকো না কেন।',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'আমি তোমাকে ভালোবাসি, শুধু এই কারণে নয় যে তুমি আমাকে বোঝো, বরং এই কারণে যে আমার হৃদয় তোমার সাথে যোগাযোগ করতে পারে, তুমি আমার থেকে যত দূরেই থাকো না কেন।',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'তোমাকে ভালোবাসার জন্য যদি আমাকে টাকা দেওয়া হতো, তাহলে এখন আমি কোটিপতি হতাম!',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'তোমাকে ভালোবাসার জন্য যদি আমাকে টাকা দেওয়া হতো, তাহলে এখন আমি কোটিপতি হতাম!',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'তোমাকে ভালোবাসার জন্য যদি আমাকে টাকা দেওয়া হতো, তাহলে এখন আমি কোটিপতি হতাম!',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'তুমিই আমার বেঁচে থাকার একমাত্র কারণ; আমি তোমাকে অনেক ভালোবাসি সোনা ❤️😘',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'তুমিই আমার বেঁচে থাকার একমাত্র কারণ; আমি তোমাকে অনেক ভালোবাসি সোনা ❤️😘',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'তুমিই আমার বেঁচে থাকার একমাত্র কারণ; আমি তোমাকে অনেক ভালোবাসি সোনা ❤️😘',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'তোমাকে ছাড়া জীবন অসম্ভব। তোমার পরের জীবন অকল্পনীয়। মৃত্যুর পরেও, আমি চাই আমাদের আত্মারা আবার মিলিত হোক!',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'তোমাকে ছাড়া জীবন অসম্ভব। তোমার পরের জীবন অকল্পনীয়। মৃত্যুর পরেও, আমি চাই আমাদের আত্মারা আবার মিলিত হোক!',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'তোমাকে ছাড়া জীবন অসম্ভব। তোমার পরের জীবন অকল্পনীয়। মৃত্যুর পরেও, আমি চাই আমাদের আত্মারা আবার মিলিত হোক!',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'তোমার সুন্দর মুখটা দেখার এবং তোমাকে জড়িয়ে ধরার জন্য আমি আকুল। মনে হচ্ছে যেন তোমার পাশে না থেকে আমি আর একটা দিনও পার করতে পারব না। তুমি যদি এখানে থাকতে!',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'তোমার সুন্দর মুখটা দেখার এবং তোমাকে জড়িয়ে ধরার জন্য আমি আকুল। মনে হচ্ছে যেন তোমার পাশে না থেকে আমি আর একটা দিনও পার করতে পারব না। তুমি যদি এখানে থাকতে!',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'তোমার সুন্দর মুখটা দেখার এবং তোমাকে জড়িয়ে ধরার জন্য আমি আকুল। মনে হচ্ছে যেন তোমার পাশে না থেকে আমি আর একটা দিনও পার করতে পারব না। তুমি যদি এখানে থাকতে!',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'তোমাকে ভালোবাসাই আমার জীবনকে বাঁচার যোগ্য করে তোলে। পৃথিবী আমাকে পাগল বলতে পারে, কিন্তু তোমার জন্য পাগল হতে পেরে আমি খুশি! আমি তোমাকে অনেক ভালোবাসি প্রিয়তমা!',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'তোমাকে ভালোবাসাই আমার জীবনকে বাঁচার যোগ্য করে তোলে। পৃথিবী আমাকে পাগল বলতে পারে, কিন্তু তোমার জন্য পাগল হতে পেরে আমি খুশি! আমি তোমাকে অনেক ভালোবাসি প্রিয়তমা!',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'তোমাকে ভালোবাসাই আমার জীবনকে বাঁচার যোগ্য করে তোলে। পৃথিবী আমাকে পাগল বলতে পারে, কিন্তু তোমার জন্য পাগল হতে পেরে আমি খুশি! আমি তোমাকে অনেক ভালোবাসি প্রিয়তমা!',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'তোমাকে আমার জীবনে পেয়ে আমি কতটা ভাগ্যবান তা কেউই পুরোপুরি ব্যাখ্যা করতে পারবে না। তোমার মতো একজন দেবদূত আমাকে উপহার দেওয়ার জন্য আমি ঈশ্বরের কাছে চির কৃতজ্ঞ! তোমাকে আন্তরিকভাবে ভালোবাসি।',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'তোমাকে আমার জীবনে পেয়ে আমি কতটা ভাগ্যবান তা কেউই পুরোপুরি ব্যাখ্যা করতে পারবে না। তোমার মতো একজন দেবদূত আমাকে উপহার দেওয়ার জন্য আমি ঈশ্বরের কাছে চির কৃতজ্ঞ! তোমাকে আন্তরিকভাবে ভালোবাসি।',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'তোমাকে আমার জীবনে পেয়ে আমি কতটা ভাগ্যবান তা কেউই পুরোপুরি ব্যাখ্যা করতে পারবে না। তোমার মতো একজন দেবদূত আমাকে উপহার দেওয়ার জন্য আমি ঈশ্বরের কাছে চির কৃতজ্ঞ! তোমাকে আন্তরিকভাবে ভালোবাসি।',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'পুরো পৃথিবী উল্টে যেতে পারে, কিন্তু তাতেও তোমার প্রতি আমার ভালোবাসা বদলাবে না। তুমি আমার কাছে সবকিছু ❤️',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'পুরো পৃথিবী উল্টে যেতে পারে, কিন্তু তাতেও তোমার প্রতি আমার ভালোবাসা বদলাবে না। তুমি আমার কাছে সবকিছু ❤️',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'পুরো পৃথিবী উল্টে যেতে পারে, কিন্তু তাতেও তোমার প্রতি আমার ভালোবাসা বদলাবে না। তুমি আমার কাছে সবকিছু ❤️',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'তোমার প্রতি আমার ভালোবাসা সমুদ্রের চেয়েও বিশাল। তোমার প্রতি আমার ভালোবাসার পরিমাণ আমি কখনোই প্রকাশ করতে পারব না। আমি শুধু এটুকুই বলতে পারি যে তোমাকে ছাড়া আমি জীবনেও বাঁচব না। আমি তোমাকে অনেক ভালোবাসি।',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'তোমার প্রতি আমার ভালোবাসা সমুদ্রের চেয়েও বিশাল। তোমার প্রতি আমার ভালোবাসার পরিমাণ আমি কখনোই প্রকাশ করতে পারব না। আমি শুধু এটুকুই বলতে পারি যে তোমাকে ছাড়া আমি জীবনেও বাঁচব না। আমি তোমাকে অনেক ভালোবাসি।',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'তোমার প্রতি আমার ভালোবাসা সমুদ্রের চেয়েও বিশাল। তোমার প্রতি আমার ভালোবাসার পরিমাণ আমি কখনোই প্রকাশ করতে পারব না। আমি শুধু এটুকুই বলতে পারি যে তোমাকে ছাড়া আমি জীবনেও বাঁচব না। আমি তোমাকে অনেক ভালোবাসি।',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'তোমার ভালোবাসা আমার শান্ত আরাম, আমার প্রিয় অনুভূতি এবং প্রতিটি দিনের সেরা অংশ।',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'তোমার ভালোবাসা আমার শান্ত আরাম, আমার প্রিয় অনুভূতি এবং প্রতিটি দিনের সেরা অংশ।',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'তোমার ভালোবাসা আমার শান্ত আরাম, আমার প্রিয় অনুভূতি এবং প্রতিটি দিনের সেরা অংশ।',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'লোকে বলে তুমি একবারই প্রেমে পড়ো, কিন্তু এটা সত্য হতে পারে না। যতবার আমি তোমার দিকে তাকাই, ততবারই আমি বারবার প্রেমে পড়ি।',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'লোকে বলে তুমি একবারই প্রেমে পড়ো, কিন্তু এটা সত্য হতে পারে না। যতবার আমি তোমার দিকে তাকাই, ততবারই আমি বারবার প্রেমে পড়ি।',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'লোকে বলে তুমি একবারই প্রেমে পড়ো, কিন্তু এটা সত্য হতে পারে না। যতবার আমি তোমার দিকে তাকাই, ততবারই আমি বারবার প্রেমে পড়ি।',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'আমার জীবনের একটা উদ্দেশ্য আছে, আর তা হলো তোমাকে জীবনের উদ্দেশ্য করে তোলা! আমি তোমাকে ভালোবাসি, প্রিয়তমা 💖',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'আমার জীবনের একটা উদ্দেশ্য আছে, আর তা হলো তোমাকে জীবনের উদ্দেশ্য করে তোলা! আমি তোমাকে ভালোবাসি, প্রিয়তমা 💖',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'আমার জীবনের একটা উদ্দেশ্য আছে, আর তা হলো তোমাকে জীবনের উদ্দেশ্য করে তোলা! আমি তোমাকে ভালোবাসি, প্রিয়তমা 💖',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'হৃদয়ের ব্যাপারটা জটিল, কিন্তু তোমাকে এই ব্যাপারটা আরও সহজ করে তুলতে পেরে আমি আনন্দিত। আমি তোমাকে অনেক ভালোবাসি।',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'হৃদয়ের ব্যাপারটা জটিল, কিন্তু তোমাকে এই ব্যাপারটা আরও সহজ করে তুলতে পেরে আমি আনন্দিত। আমি তোমাকে অনেক ভালোবাসি।',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'হৃদয়ের ব্যাপারটা জটিল, কিন্তু তোমাকে এই ব্যাপারটা আরও সহজ করে তুলতে পেরে আমি আনন্দিত। আমি তোমাকে অনেক ভালোবাসি।',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'তোমার সাথে জীবন অতিপ্রাকৃত এবং জাদুকরী মনে হয়। তোমার অস্তিত্ব আমাকে আশীর্বাদ করার জন্য ধন্যবাদ।',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'তোমার সাথে জীবন অতিপ্রাকৃত এবং জাদুকরী মনে হয়। তোমার অস্তিত্ব আমাকে আশীর্বাদ করার জন্য ধন্যবাদ।',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'তোমার সাথে জীবন অতিপ্রাকৃত এবং জাদুকরী মনে হয়। তোমার অস্তিত্ব আমাকে আশীর্বাদ করার জন্য ধন্যবাদ।',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'তুমি জানো না আমার হৃদয় তোমার জন্য কত কিছু রেখেছে। তুমি আমার জীবনে আসার পর থেকে আমার জীবন সবচেয়ে ভালো। ❤️',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'তুমি জানো না আমার হৃদয় তোমার জন্য কত কিছু রেখেছে। তুমি আমার জীবনে আসার পর থেকে আমার জীবন সবচেয়ে ভালো। ❤️',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'তুমি জানো না আমার হৃদয় তোমার জন্য কত কিছু রেখেছে। তুমি আমার জীবনে আসার পর থেকে আমার জীবন সবচেয়ে ভালো। ❤️',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'আমি আমার জীবনে তোমার মতো কাউকে পাইনি, আর মনে হয় না কখনো পাবো। তুমি লক্ষ লক্ষের মধ্যে একজন এবং আমি খুব ভাগ্যবান যে তোমাকে দেখতে পেয়েছি।',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'আমি আমার জীবনে তোমার মতো কাউকে পাইনি, আর মনে হয় না কখনো পাবো। তুমি লক্ষ লক্ষের মধ্যে একজন এবং আমি খুব ভাগ্যবান যে তোমাকে দেখতে পেয়েছি।',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'আমি আমার জীবনে তোমার মতো কাউকে পাইনি, আর মনে হয় না কখনো পাবো। তুমি লক্ষ লক্ষের মধ্যে একজন এবং আমি খুব ভাগ্যবান যে তোমাকে দেখতে পেয়েছি।',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'বেঁচে থাকার জন্য, মানুষের বাতাস, খাবার এবং জলের প্রয়োজন। আমার শুধু তোমার আলিঙ্গন, হাসি এবং চুম্বন দরকার 😘❤️। আমি তোমাকে ভালোবাসি।',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'বেঁচে থাকার জন্য, মানুষের বাতাস, খাবার এবং জলের প্রয়োজন। আমার শুধু তোমার আলিঙ্গন, হাসি এবং চুম্বন দরকার 😘❤️। আমি তোমাকে ভালোবাসি।',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'বেঁচে থাকার জন্য, মানুষের বাতাস, খাবার এবং জলের প্রয়োজন। আমার শুধু তোমার আলিঙ্গন, হাসি এবং চুম্বন দরকার 😘❤️। আমি তোমাকে ভালোবাসি।',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'যখন আমি তোমার হাত ধরি আর তুমি হাসো, তখন আমি মনে মনে ভাবি, "স্বর্গ নিশ্চয়ই এমনই।" 🥰',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'যখন আমি তোমার হাত ধরি আর তুমি হাসো, তখন আমি মনে মনে ভাবি, "স্বর্গ নিশ্চয়ই এমনই।" 🥰',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'যখন আমি তোমার হাত ধরি আর তুমি হাসো, তখন আমি মনে মনে ভাবি, "স্বর্গ নিশ্চয়ই এমনই।" 🥰',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'আমরা যে স্মৃতিগুলো ভাগ করে নিয়েছি, সেগুলো আমি খুব ভালোবাসি এবং ভবিষ্যতের জন্য অধীর আগ্রহে অপেক্ষা করতে পারছি না! তোমাকে ভালোবাসি!',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'আমরা যে স্মৃতিগুলো ভাগ করে নিয়েছি, সেগুলো আমি খুব ভালোবাসি এবং ভবিষ্যতের জন্য অধীর আগ্রহে অপেক্ষা করতে পারছি না! তোমাকে ভালোবাসি!',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'আমরা যে স্মৃতিগুলো ভাগ করে নিয়েছি, সেগুলো আমি খুব ভালোবাসি এবং ভবিষ্যতের জন্য অধীর আগ্রহে অপেক্ষা করতে পারছি না! তোমাকে ভালোবাসি!',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'তোমার বাহুই আমার একমাত্র প্রয়োজন, আর চিরকালই আমার এগুলোর প্রয়োজন হবে।',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'তোমার বাহুই আমার একমাত্র প্রয়োজন, আর চিরকালই আমার এগুলোর প্রয়োজন হবে।',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'তোমার বাহুই আমার একমাত্র প্রয়োজন, আর চিরকালই আমার এগুলোর প্রয়োজন হবে।',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'আমার প্রিয়া স্ত্রী, তোমাদের সকলকে আমার ভালোবাসা এবং শুভেচ্ছা জানাচ্ছি।',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'আমার প্রিয়া স্ত্রী, তোমাদের সকলকে আমার ভালোবাসা এবং শুভেচ্ছা জানাচ্ছি।',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'আমার প্রিয়া স্ত্রী, তোমাদের সকলকে আমার ভালোবাসা এবং শুভেচ্ছা জানাচ্ছি।',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message:
                'আমার জীবনে তুমিই একমাত্র জিনিস যা আমি চাই। আমি তোমাকে ভালোবাসি ❤️',
            favoriteButton: () {},
            shareButton: () {
              Share.share(
                'আমার জীবনে তুমিই একমাত্র জিনিস যা আমি চাই। আমি তোমাকে ভালোবাসি ❤️',
              );
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text:
                      'আমার জীবনে তুমিই একমাত্র জিনিস যা আমি চাই। আমি তোমাকে ভালোবাসি ❤️',
                ),
              );
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার ভালোবাসা আর যত্ন আমাকে এমন অনুভূতি দেয় যে তুমি আমার সাথে থাকলে যেকোনো কিছুই সম্ভব। আমি তোমাকে অনেক ভালোবাসি, আমার ভালোবাসা।',
            favoriteButton: () {},
            shareButton: () {
              Share.share('তোমার ভালোবাসা আর যত্ন আমাকে এমন অনুভূতি দেয় যে তুমি আমার সাথে থাকলে যেকোনো কিছুই সম্ভব। আমি তোমাকে অনেক ভালোবাসি, আমার ভালোবাসা।');
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমার ভালোবাসা আর যত্ন আমাকে এমন অনুভূতি দেয় যে তুমি আমার সাথে থাকলে যেকোনো কিছুই সম্ভব। আমি তোমাকে অনেক ভালোবাসি, আমার ভালোবাসা।',));
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমার অতীত জীবনে আমি নিশ্চয়ই একটি সম্পূর্ণ জাতিকে বাঁচিয়েছি, এই জীবনে তোমাকে আমার জীবনের ভালোবাসা হিসেবে পেয়ে ধন্য হয়েছি। আমি তোমাকে ভালোবাসি।',
            favoriteButton: () {},
            shareButton: () {
              Share.share('আমার অতীত জীবনে আমি নিশ্চয়ই একটি সম্পূর্ণ জাতিকে বাঁচিয়েছি, এই জীবনে তোমাকে আমার জীবনের ভালোবাসা হিসেবে পেয়ে ধন্য হয়েছি। আমি তোমাকে ভালোবাসি।');
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমার অতীত জীবনে আমি নিশ্চয়ই একটি সম্পূর্ণ জাতিকে বাঁচিয়েছি, এই জীবনে তোমাকে আমার জীবনের ভালোবাসা হিসেবে পেয়ে ধন্য হয়েছি। আমি তোমাকে ভালোবাসি।',));
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার হাসি আমার সবচেয়ে প্রিয় জিনিস এবং আমি সারাদিন ক্লান্ত না হয়েও তোমার মুখ দেখতে পাই। আমার হৃদয়ের প্রতিটি স্পন্দনে আমি তোমাকে ভালোবাসি। ❤️',
            favoriteButton: () {},
            shareButton: () {
              Share.share('তোমার হাসি আমার সবচেয়ে প্রিয় জিনিস এবং আমি সারাদিন ক্লান্ত না হয়েও তোমার মুখ দেখতে পাই। আমার হৃদয়ের প্রতিটি স্পন্দনে আমি তোমাকে ভালোবাসি। ❤️');
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমার হাসি আমার সবচেয়ে প্রিয় জিনিস এবং আমি সারাদিন ক্লান্ত না হয়েও তোমার মুখ দেখতে পাই। আমার হৃদয়ের প্রতিটি স্পন্দনে আমি তোমাকে ভালোবাসি। ❤️',));
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তুমি কি জানো কেন তোমার আঙ্গুলের মাঝে ফাঁকা জায়গা থাকে? যাতে আমি তোমার হাত ধরে ফাঁকা জায়গাগুলো পূরণ করতে পারি ❤️।',
            favoriteButton: () {},
            shareButton: () {
              Share.share('তুমি কি জানো কেন তোমার আঙ্গুলের মাঝে ফাঁকা জায়গা থাকে? যাতে আমি তোমার হাত ধরে ফাঁকা জায়গাগুলো পূরণ করতে পারি ❤️।');
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তুমি কি জানো কেন তোমার আঙ্গুলের মাঝে ফাঁকা জায়গা থাকে? যাতে আমি তোমার হাত ধরে ফাঁকা জায়গাগুলো পূরণ করতে পারি ❤️।',));
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তুমি পাহাড় থেকে পড়ে যেতে পারো, গাছ থেকে পড়ে যেতে পারো, কিন্তু পড়ে যাওয়ার সবচেয়ে ভালো উপায় হল আমার প্রেমে পড়া 😘💞।',
            favoriteButton: () {},
            shareButton: () {
              Share.share('তুমি পাহাড় থেকে পড়ে যেতে পারো, গাছ থেকে পড়ে যেতে পারো, কিন্তু পড়ে যাওয়ার সবচেয়ে ভালো উপায় হল আমার প্রেমে পড়া 😘💞।');
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তুমি পাহাড় থেকে পড়ে যেতে পারো, গাছ থেকে পড়ে যেতে পারো, কিন্তু পড়ে যাওয়ার সবচেয়ে ভালো উপায় হল আমার প্রেমে পড়া 😘💞।',));
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমার জীবন একটা স্বপ্ন, আর তুমি এর মধ্যে থাকা সুন্দরী পরী 🧚‍♀️✨। সবচেয়ে ভালো কথা হলো, আমি ঘুম থেকে উঠলেও তুমি কখনো অদৃশ্য হও না। তোমাকে ভালোবাসি, প্রিয়তম 💖।',
            favoriteButton: () {},
            shareButton: () {
              Share.share('আমার জীবন একটা স্বপ্ন, আর তুমি এর মধ্যে থাকা সুন্দরী পরী 🧚‍♀️✨। সবচেয়ে ভালো কথা হলো, আমি ঘুম থেকে উঠলেও তুমি কখনো অদৃশ্য হও না। তোমাকে ভালোবাসি, প্রিয়তম 💖।');
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমার জীবন একটা স্বপ্ন, আর তুমি এর মধ্যে থাকা সুন্দরী পরী 🧚‍♀️✨। সবচেয়ে ভালো কথা হলো, আমি ঘুম থেকে উঠলেও তুমি কখনো অদৃশ্য হও না। তোমাকে ভালোবাসি, প্রিয়তম 💖।',));
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমি তোমাকে ভালোবাসি আর তুমিও আমাকে ভালোবাসো। আমার হৃদয়ে, তুমি সবসময় থাকবে। এখানে হোক বা সেখানে, কাছে হোক বা দূরে, আমার ভালোবাসা তুমি যেখানেই থাকো না কেন ❤️।',
            favoriteButton: () {},
            shareButton: () {
              Share.share('আমি তোমাকে ভালোবাসি আর তুমিও আমাকে ভালোবাসো। আমার হৃদয়ে, তুমি সবসময় থাকবে। এখানে হোক বা সেখানে, কাছে হোক বা দূরে, আমার ভালোবাসা তুমি যেখানেই থাকো না কেন ❤️।');
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমি তোমাকে ভালোবাসি আর তুমিও আমাকে ভালোবাসো। আমার হৃদয়ে, তুমি সবসময় থাকবে। এখানে হোক বা সেখানে, কাছে হোক বা দূরে, আমার ভালোবাসা তুমি যেখানেই থাকো না কেন ❤️।',));
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'ভালোবাসা হলো এমন একটি প্রতিশ্রুতি যে, তোমার পথে যত কাঁটাই আসুক না কেন, তোমার চারপাশে সবসময় একটি মিষ্টি গন্ধযুক্ত গোলাপ থাকবে 🌹💘।',
            favoriteButton: () {},
            shareButton: () {
              Share.share('ভালোবাসা হলো এমন একটি প্রতিশ্রুতি যে, তোমার পথে যত কাঁটাই আসুক না কেন, তোমার চারপাশে সবসময় একটি মিষ্টি গন্ধযুক্ত গোলাপ থাকবে 🌹💘।');
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'ভালোবাসা হলো এমন একটি প্রতিশ্রুতি যে, তোমার পথে যত কাঁটাই আসুক না কেন, তোমার চারপাশে সবসময় একটি মিষ্টি গন্ধযুক্ত গোলাপ থাকবে 🌹💘।',));
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার সাথে দেখা না হওয়ার আগে আমি কখনোই অলৌকিক ঘটনায় বিশ্বাস করতাম না। এখন আমি আগের চেয়েও বেশি ঈশ্বরের কাজে বিশ্বাস করি।',
            favoriteButton: () {},
            shareButton: () {
              Share.share('তোমার সাথে দেখা না হওয়ার আগে আমি কখনোই অলৌকিক ঘটনায় বিশ্বাস করতাম না। এখন আমি আগের চেয়েও বেশি ঈশ্বরের কাজে বিশ্বাস করি।');
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'ভতোমার সাথে দেখা না হওয়ার আগে আমি কখনোই অলৌকিক ঘটনায় বিশ্বাস করতাম না। এখন আমি আগের চেয়েও বেশি ঈশ্বরের কাজে বিশ্বাস করি।',));
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমি বিশ্বাস করি আমরা একে অপরের জন্য নির্বাচিত হয়েছি। আমাদের ভালোবাসা আরও বড় কিছুর অংশ, যা কেবল ঈশ্বরই লিখতে পারতেন।',
            favoriteButton: () {},
            shareButton: () {
              Share.share('আমি বিশ্বাস করি আমরা একে অপরের জন্য নির্বাচিত হয়েছি। আমাদের ভালোবাসা আরও বড় কিছুর অংশ, যা কেবল ঈশ্বরই লিখতে পারতেন।');
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমি বিশ্বাস করি আমরা একে অপরের জন্য নির্বাচিত হয়েছি। আমাদের ভালোবাসা আরও বড় কিছুর অংশ, যা কেবল ঈশ্বরই লিখতে পারতেন।',));
              ScaffoldMessenger.of(
                context,
              ).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমাকে আমার জীবনে আনার জন্য আমি প্রতিদিন যীশুকে ধন্যবাদ জানাই। তোমার ভালোবাসা আমাকে ঈশ্বরের অনুগ্রহ এবং দয়ার কথা মনে করিয়ে দেয়।',
            favoriteButton: () {},
            shareButton: () {
              Share.share('তোমাকে আমার জীবনে আনার জন্য আমি প্রতিদিন যীশুকে ধন্যবাদ জানাই। তোমার ভালোবাসা আমাকে ঈশ্বরের অনুগ্রহ এবং দয়ার কথা মনে করিয়ে দেয়।');
            },
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমাকে আমার জীবনে আনার জন্য আমি প্রতিদিন যীশুকে ধন্যবাদ জানাই। তোমার ভালোবাসা আমাকে ঈশ্বরের অনুগ্রহ এবং দয়ার কথা মনে করিয়ে দেয়।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'মাঝে মাঝে আমার মনে হয় আমাদের ভালোবাসা অনেক আগেই লেখা হয়ে গেছে। ঠিক যেমন রাধা কৃষ্ণের জন্য তৈরি হয়েছিল, আমার মনে হয় আমি তোমার জন্য তৈরি হয়েছি।',
            favoriteButton: () {},
            shareButton: () {Share.share('মাঝে মাঝে আমার মনে হয় আমাদের ভালোবাসা অনেক আগেই লেখা হয়ে গেছে। ঠিক যেমন রাধা কৃষ্ণের জন্য তৈরি হয়েছিল, আমার মনে হয় আমি তোমার জন্য তৈরি হয়েছি।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'মাঝে মাঝে আমার মনে হয় আমাদের ভালোবাসা অনেক আগেই লেখা হয়ে গেছে। ঠিক যেমন রাধা কৃষ্ণের জন্য তৈরি হয়েছিল, আমার মনে হয় আমি তোমার জন্য তৈরি হয়েছি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমাদের ভালোবাসা নিরাপদ বোধ করে কারণ আমি জানি ঈশ্বর এর কেন্দ্রবিন্দুতে আছেন।',
            favoriteButton: () {},
            shareButton: () {Share.share('আমাদের ভালোবাসা নিরাপদ বোধ করে কারণ আমি জানি ঈশ্বর এর কেন্দ্রবিন্দুতে আছেন।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমাদের ভালোবাসা নিরাপদ বোধ করে কারণ আমি জানি ঈশ্বর এর কেন্দ্রবিন্দুতে আছেন।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমি বিশ্বাস করি ঈশ্বর আমাদের একসাথে এনেছেন একটা কারণে। তোমার ভালোবাসা আমার জীবনকে পরিপূর্ণ করে তুলেছে! তোমার জন্য আমি প্রতিদিন তাঁর কাছে কৃতজ্ঞ।',
            favoriteButton: () {},
            shareButton: () {Share.share('আমি বিশ্বাস করি ঈশ্বর আমাদের একসাথে এনেছেন একটা কারণে। তোমার ভালোবাসা আমার জীবনকে পরিপূর্ণ করে তুলেছে! তোমার জন্য আমি প্রতিদিন তাঁর কাছে কৃতজ্ঞ।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমি বিশ্বাস করি ঈশ্বর আমাদের একসাথে এনেছেন একটা কারণে। তোমার ভালোবাসা আমার জীবনকে পরিপূর্ণ করে তুলেছে! তোমার জন্য আমি প্রতিদিন তাঁর কাছে কৃতজ্ঞ।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমার দেখা সবচেয়ে অসাধারণ নারীর পাশে দাঁড়াতে পারাটা সত্যিই অসাধারণ। আমি সত্যিই সবচেয়ে ভাগ্যবান পুরুষ! তোমাকে ভালোবাসি সোনা!',
            favoriteButton: () {},
            shareButton: () {Share.share('আমার দেখা সবচেয়ে অসাধারণ নারীর পাশে দাঁড়াতে পারাটা সত্যিই অসাধারণ। আমি সত্যিই সবচেয়ে ভাগ্যবান পুরুষ! তোমাকে ভালোবাসি সোনা!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমার দেখা সবচেয়ে অসাধারণ নারীর পাশে দাঁড়াতে পারাটা সত্যিই অসাধারণ। আমি সত্যিই সবচেয়ে ভাগ্যবান পুরুষ! তোমাকে ভালোবাসি সোনা!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'বাবু, আমি যখন কাজ করি তখন তুমি কি আমার কথা ভুলে থাকতে পারো? কারণ তুমিই সেই ব্যক্তি যার কথা আমি সবসময় ভাবি।',
            favoriteButton: () {},
            shareButton: () {Share.share('বাবু, আমি যখন কাজ করি তখন তুমি কি আমার কথা ভুলে থাকতে পারো? কারণ তুমিই সেই ব্যক্তি যার কথা আমি সবসময় ভাবি।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'বাবু, আমি যখন কাজ করি তখন তুমি কি আমার কথা ভুলে থাকতে পারো? কারণ তুমিই সেই ব্যক্তি যার কথা আমি সবসময় ভাবি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'কিছু মানুষ বৃদ্ধ হওয়ার সাথে সাথে আরও মিষ্টি হয়ে ওঠে, আর কিছু ভালোবাসা সময়ের সাথে সাথে আরও শক্তিশালী হয়। প্রথমটি তোমার জন্য সত্য এবং দ্বিতীয়টি আমার জন্য!',
            favoriteButton: () {},
            shareButton: () {Share.share('কিছু মানুষ বৃদ্ধ হওয়ার সাথে সাথে আরও মিষ্টি হয়ে ওঠে, আর কিছু ভালোবাসা সময়ের সাথে সাথে আরও শক্তিশালী হয়। প্রথমটি তোমার জন্য সত্য এবং দ্বিতীয়টি আমার জন্য!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'কিছু মানুষ বৃদ্ধ হওয়ার সাথে সাথে আরও মিষ্টি হয়ে ওঠে, আর কিছু ভালোবাসা সময়ের সাথে সাথে আরও শক্তিশালী হয়। প্রথমটি তোমার জন্য সত্য এবং দ্বিতীয়টি আমার জন্য!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'যদি অবতার সত্য হয়, তাহলে আমি আমার প্রতিটি জীবনে তোমাকে আমার জীবনসঙ্গী হিসেবে চাইব। তুমিই আমার শক্তি এবং সবচেয়ে বড় অনুপ্রেরণা।',
            favoriteButton: () {},
            shareButton: () {Share.share('যদি অবতার সত্য হয়, তাহলে আমি আমার প্রতিটি জীবনে তোমাকে আমার জীবনসঙ্গী হিসেবে চাইব। তুমিই আমার শক্তি এবং সবচেয়ে বড় অনুপ্রেরণা।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'যদি অবতার সত্য হয়, তাহলে আমি আমার প্রতিটি জীবনে তোমাকে আমার জীবনসঙ্গী হিসেবে চাইব। তুমিই আমার শক্তি এবং সবচেয়ে বড় অনুপ্রেরণা।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার সমস্ত অপূর্ণতা থাকা সত্ত্বেও তুমি নিখুঁত। তুমি অসাধারণ, এমনকি যখন তুমি বিরক্তিকরও হও। সবকিছুর জন্য আমি তোমাকে ভালোবাসি!',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমার সমস্ত অপূর্ণতা থাকা সত্ত্বেও তুমি নিখুঁত। তুমি অসাধারণ, এমনকি যখন তুমি বিরক্তিকরও হও। সবকিছুর জন্য আমি তোমাকে ভালোবাসি!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমার সমস্ত অপূর্ণতা থাকা সত্ত্বেও তুমি নিখুঁত। তুমি অসাধারণ, এমনকি যখন তুমি বিরক্তিকরও হও। সবকিছুর জন্য আমি তোমাকে ভালোবাসি!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমাকে মনে করিয়ে দেওয়ার জন্য একটা ছোট্ট নোট, তুমি আমার দিনের সেরা অংশ। তোমাকে পাশে পেয়ে কৃতজ্ঞ। তোমাকে সবসময় ভালোবাসি।',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমাকে মনে করিয়ে দেওয়ার জন্য একটা ছোট্ট নোট, তুমি আমার দিনের সেরা অংশ। তোমাকে পাশে পেয়ে কৃতজ্ঞ। তোমাকে সবসময় ভালোবাসি।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমাকে মনে করিয়ে দেওয়ার জন্য একটা ছোট্ট নোট, তুমি আমার দিনের সেরা অংশ। তোমাকে পাশে পেয়ে কৃতজ্ঞ। তোমাকে সবসময় ভালোবাসি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমার জীবনকে অসাধারণ করে তোলার জন্য ধন্যবাদ। জীবনের শেষ দিন পর্যন্ত আমি তোমাকে ভালোবাসবো।',
            favoriteButton: () {},
            shareButton: () {Share.share('আমার জীবনকে অসাধারণ করে তোলার জন্য ধন্যবাদ। জীবনের শেষ দিন পর্যন্ত আমি তোমাকে ভালোবাসবো।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমার জীবনকে অসাধারণ করে তোলার জন্য ধন্যবাদ। জীবনের শেষ দিন পর্যন্ত আমি তোমাকে ভালোবাসবো।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'পৃথিবীর সবচেয়ে সুন্দরী স্ত্রীর কোলে নিতে পেরে আমি নিজেকে ধন্য মনে করছি। আমি তোমাকে সবসময় এবং চিরকাল ভালোবাসি।',
            favoriteButton: () {},
            shareButton: () {Share.share('পৃথিবীর সবচেয়ে সুন্দরী স্ত্রীর কোলে নিতে পেরে আমি নিজেকে ধন্য মনে করছি। আমি তোমাকে সবসময় এবং চিরকাল ভালোবাসি।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'পৃথিবীর সবচেয়ে সুন্দরী স্ত্রীর কোলে নিতে পেরে আমি নিজেকে ধন্য মনে করছি। আমি তোমাকে সবসময় এবং চিরকাল ভালোবাসি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'প্রতিদিন তোমার পাশে ঘুম থেকে ওঠা আমার জীবনের সবচেয়ে বড় আশীর্বাদ। তুমিই আমার পুরো পৃথিবী, সোনা। 💗',
            favoriteButton: () {},
            shareButton: () {Share.share('প্রতিদিন তোমার পাশে ঘুম থেকে ওঠা আমার জীবনের সবচেয়ে বড় আশীর্বাদ। তুমিই আমার পুরো পৃথিবী, সোনা। 💗');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'প্রতিদিন তোমার পাশে ঘুম থেকে ওঠা আমার জীবনের সবচেয়ে বড় আশীর্বাদ। তুমিই আমার পুরো পৃথিবী, সোনা। 💗',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার জন্যই এই বছরগুলো আমার জীবনের সবচেয়ে আনন্দের মুহূর্ত ছিল। তোমার যত্ন এবং স্নেহের জন্য ধন্যবাদ। তোমাকে ভালোবাসা পৃথিবীর সেরা অনুভূতিগুলির মধ্যে একটি।',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমার জন্যই এই বছরগুলো আমার জীবনের সবচেয়ে আনন্দের মুহূর্ত ছিল। তোমার যত্ন এবং স্নেহের জন্য ধন্যবাদ। তোমাকে ভালোবাসা পৃথিবীর সেরা অনুভূতিগুলির মধ্যে একটি।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমার জন্যই এই বছরগুলো আমার জীবনের সবচেয়ে আনন্দের মুহূর্ত ছিল। তোমার যত্ন এবং স্নেহের জন্য ধন্যবাদ। তোমাকে ভালোবাসা পৃথিবীর সেরা অনুভূতিগুলির মধ্যে একটি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার সাথে কাটানো প্রতিটি মুহূর্ত আমাকে তোমার প্রেমে আরও বেশি করে ফেলছে। তুমি আমার স্বপ্নের নারী। আমি সত্যিই ধন্য যে এমন একজন অসাধারণ স্ত্রী পেয়েছি।',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমার সাথে কাটানো প্রতিটি মুহূর্ত আমাকে তোমার প্রেমে আরও বেশি করে ফেলছে। তুমি আমার স্বপ্নের নারী। আমি সত্যিই ধন্য যে এমন একজন অসাধারণ স্ত্রী পেয়েছি।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমার সাথে কাটানো প্রতিটি মুহূর্ত আমাকে তোমার প্রেমে আরও বেশি করে ফেলছে। তুমি আমার স্বপ্নের নারী। আমি সত্যিই ধন্য যে এমন একজন অসাধারণ স্ত্রী পেয়েছি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তুমি পৃথিবীর সবচেয়ে দয়ালু, মজাদার, বুদ্ধিমতী এবং সবচেয়ে সুন্দরী নারী। তোমার স্বামী হতে পেরে আমি নিজেকে অনেক ভাগ্যবান মনে করি!',
            favoriteButton: () {},
            shareButton: () {Share.share('তুমি পৃথিবীর সবচেয়ে দয়ালু, মজাদার, বুদ্ধিমতী এবং সবচেয়ে সুন্দরী নারী। তোমার স্বামী হতে পেরে আমি নিজেকে অনেক ভাগ্যবান মনে করি!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তুমি পৃথিবীর সবচেয়ে দয়ালু, মজাদার, বুদ্ধিমতী এবং সবচেয়ে সুন্দরী নারী। তোমার স্বামী হতে পেরে আমি নিজেকে অনেক ভাগ্যবান মনে করি!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমরা একে অপরের থেকে যত দূরেই থাকি না কেন, জেনে রেখো আমি সবসময় তোমারই থাকব। তোমাকে ভালোবাসি, সোনা। 💗',
            favoriteButton: () {},
            shareButton: () {Share.share('আমরা একে অপরের থেকে যত দূরেই থাকি না কেন, জেনে রেখো আমি সবসময় তোমারই থাকব। তোমাকে ভালোবাসি, সোনা। 💗');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমরা একে অপরের থেকে যত দূরেই থাকি না কেন, জেনে রেখো আমি সবসময় তোমারই থাকব। তোমাকে ভালোবাসি, সোনা। 💗',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার ভালোবাসা, সমর্থন এবং যত্ন আমাকে আমার মতো মানুষ করে তুলেছে, এবং আমি সবসময় তোমার যোগ্য হতে চেষ্টা করব।',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমার ভালোবাসা, সমর্থন এবং যত্ন আমাকে আমার মতো মানুষ করে তুলেছে, এবং আমি সবসময় তোমার যোগ্য হতে চেষ্টা করব।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমার ভালোবাসা, সমর্থন এবং যত্ন আমাকে আমার মতো মানুষ করে তুলেছে, এবং আমি সবসময় তোমার যোগ্য হতে চেষ্টা করব।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমাকে ছাড়া আমি নিজেকে কল্পনাও করতে পারি না। সবসময় আমার সাথে থাকার জন্য ধন্যবাদ। তোমাকে ভালোবাসি, আমার প্রিয় স্ত্রী।',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমাকে ছাড়া আমি নিজেকে কল্পনাও করতে পারি না। সবসময় আমার সাথে থাকার জন্য ধন্যবাদ। তোমাকে ভালোবাসি, আমার প্রিয় স্ত্রী।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমাকে ছাড়া আমি নিজেকে কল্পনাও করতে পারি না। সবসময় আমার সাথে থাকার জন্য ধন্যবাদ। তোমাকে ভালোবাসি, আমার প্রিয় স্ত্রী।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'সকালে ঘুম থেকে উঠে যখন আমি প্রথমে তোমার মুখ দেখি, তখনই আমার দিনটা সুন্দর হয়ে ওঠে। আমার জীবনের অংশ হওয়ার জন্য ধন্যবাদ।',
            favoriteButton: () {},
            shareButton: () {Share.share('সকালে ঘুম থেকে উঠে যখন আমি প্রথমে তোমার মুখ দেখি, তখনই আমার দিনটা সুন্দর হয়ে ওঠে। আমার জীবনের অংশ হওয়ার জন্য ধন্যবাদ।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'সকালে ঘুম থেকে উঠে যখন আমি প্রথমে তোমার মুখ দেখি, তখনই আমার দিনটা সুন্দর হয়ে ওঠে। আমার জীবনের অংশ হওয়ার জন্য ধন্যবাদ।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তুমি আমার জীবনে আসার আগে, সবকিছু এত এলোমেলো ছিল; আমি কখনোই জীবন নিয়ে সিরিয়াস ছিলাম না। তুমি আমাকে আমার দায়িত্ব বুঝতে শিখিয়েছ। তোমাকে আমার স্ত্রী হিসেবে পেয়ে আমি ধন্য।',
            favoriteButton: () {},
            shareButton: () {Share.share('তুমি আমার জীবনে আসার আগে, সবকিছু এত এলোমেলো ছিল; আমি কখনোই জীবন নিয়ে সিরিয়াস ছিলাম না। তুমি আমাকে আমার দায়িত্ব বুঝতে শিখিয়েছ। তোমাকে আমার স্ত্রী হিসেবে পেয়ে আমি ধন্য।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তুমি আমার জীবনে আসার আগে, সবকিছু এত এলোমেলো ছিল; আমি কখনোই জীবন নিয়ে সিরিয়াস ছিলাম না। তুমি আমাকে আমার দায়িত্ব বুঝতে শিখিয়েছ। তোমাকে আমার স্ত্রী হিসেবে পেয়ে আমি ধন্য।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমার স্ত্রী হওয়ার জন্য এবং আমার জীবন পূর্ণ করার জন্য তোমাকে ধন্যবাদ। তোমার সাথে অনন্ত বছরের একতা কামনা করছি, আমার ভালোবাসা!',
            favoriteButton: () {},
            shareButton: () {Share.share('আমার স্ত্রী হওয়ার জন্য এবং আমার জীবন পূর্ণ করার জন্য তোমাকে ধন্যবাদ। তোমার সাথে অনন্ত বছরের একতা কামনা করছি, আমার ভালোবাসা!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমার স্ত্রী হওয়ার জন্য এবং আমার জীবন পূর্ণ করার জন্য তোমাকে ধন্যবাদ। তোমার সাথে অনন্ত বছরের একতা কামনা করছি, আমার ভালোবাসা!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার কথা ভাবলেই আমার খুব ভালো লাগে। তুমিই সবচেয়ে ভালো স্ত্রী যাকে যেকোনো পুরুষ কখনোই চাইবে না।',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমার কথা ভাবলেই আমার খুব ভালো লাগে। তুমিই সবচেয়ে ভালো স্ত্রী যাকে যেকোনো পুরুষ কখনোই চাইবে না।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমার কথা ভাবলেই আমার খুব ভালো লাগে। তুমিই সবচেয়ে ভালো স্ত্রী যাকে যেকোনো পুরুষ কখনোই চাইবে না।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'প্রতিটি সফল পুরুষের পিছনে একজন নারী থাকে - যেই এটা বলেছে সে ১০০ শতাংশ ঠিক বলেছে। তুমিই আমার সাফল্যের রহস্য, আমার প্রিয় স্ত্রী। আমি তোমাকে ভালোবাসি।',
            favoriteButton: () {},
            shareButton: () {Share.share('প্রতিটি সফল পুরুষের পিছনে একজন নারী থাকে - যেই এটা বলেছে সে ১০০ শতাংশ ঠিক বলেছে। তুমিই আমার সাফল্যের রহস্য, আমার প্রিয় স্ত্রী। আমি তোমাকে ভালোবাসি।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'প্রতিটি সফল পুরুষের পিছনে একজন নারী থাকে - যেই এটা বলেছে সে ১০০ শতাংশ ঠিক বলেছে। তুমিই আমার সাফল্যের রহস্য, আমার প্রিয় স্ত্রী। আমি তোমাকে ভালোবাসি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তুমি আমার ফ্রেঞ্চ ফ্রাই, আর আমি তোমার বার্গার। আমরা একে অপরের জন্য নিখুঁতভাবে তৈরি!',
            favoriteButton: () {},
            shareButton: () {Share.share('তুমি আমার ফ্রেঞ্চ ফ্রাই, আর আমি তোমার বার্গার। আমরা একে অপরের জন্য নিখুঁতভাবে তৈরি!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তুমি আমার ফ্রেঞ্চ ফ্রাই, আর আমি তোমার বার্গার। আমরা একে অপরের জন্য নিখুঁতভাবে তৈরি!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমি ঈর্ষান্বিত স্বামী নই, কিন্তু আমি কাউকে ০.০০১ সেকেন্ডের বেশি তোমার দিকে তাকিয়ে থাকতে দেব না।',
            favoriteButton: () {},
            shareButton: () {Share.share('আমি ঈর্ষান্বিত স্বামী নই, কিন্তু আমি কাউকে ০.০০১ সেকেন্ডের বেশি তোমার দিকে তাকিয়ে থাকতে দেব না।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমি ঈর্ষান্বিত স্বামী নই, কিন্তু আমি কাউকে ০.০০১ সেকেন্ডের বেশি তোমার দিকে তাকিয়ে থাকতে দেব না।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার ভালোবাসা আমার জীবনে অক্সিজেনের মতো। তোমাকে ধন্যবাদ, আমার সুন্দরী স্ত্রী। আমি তোমাকে ভালোবাসি! 💗',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমার ভালোবাসা আমার জীবনে অক্সিজেনের মতো। তোমাকে ধন্যবাদ, আমার সুন্দরী স্ত্রী। আমি তোমাকে ভালোবাসি! 💗');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমার ভালোবাসা আমার জীবনে অক্সিজেনের মতো। তোমাকে ধন্যবাদ, আমার সুন্দরী স্ত্রী। আমি তোমাকে ভালোবাসি! 💗',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমাকে আমার আত্মার সাথী এবং জীবনসঙ্গী হিসেবে বেছে নেওয়া আমার সবচেয়ে বড় সিদ্ধান্ত! তুমি যা করেছো তার জন্য আমি কৃতজ্ঞ। আমার স্ত্রী, আমি তোমাকে চিরকাল ভালোবাসবো।',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমাকে আমার আত্মার সাথী এবং জীবনসঙ্গী হিসেবে বেছে নেওয়া আমার সবচেয়ে বড় সিদ্ধান্ত! তুমি যা করেছো তার জন্য আমি কৃতজ্ঞ। আমার স্ত্রী, আমি তোমাকে চিরকাল ভালোবাসবো।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমাকে আমার আত্মার সাথী এবং জীবনসঙ্গী হিসেবে বেছে নেওয়া আমার সবচেয়ে বড় সিদ্ধান্ত! তুমি যা করেছো তার জন্য আমি কৃতজ্ঞ। আমার স্ত্রী, আমি তোমাকে চিরকাল ভালোবাসবো।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমাকে আমার জীবনে পেয়ে আমি খুবই কৃতজ্ঞ, আমার ভালোবাসা। তুমি আমার সবচেয়ে মূল্যবান উপহার, আমার সবচেয়ে বড় সাফল্য! তোমাকে সবসময় ভালোবাসি!',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমাকে আমার জীবনে পেয়ে আমি খুবই কৃতজ্ঞ, আমার ভালোবাসা। তুমি আমার সবচেয়ে মূল্যবান উপহার, আমার সবচেয়ে বড় সাফল্য! তোমাকে সবসময় ভালোবাসি!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমাকে আমার জীবনে পেয়ে আমি খুবই কৃতজ্ঞ, আমার ভালোবাসা। তুমি আমার সবচেয়ে মূল্যবান উপহার, আমার সবচেয়ে বড় সাফল্য! তোমাকে সবসময় ভালোবাসি!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'প্রিয়তমা, তোমার চেয়ে আমার আর কেউ থাকতে ভালোবাসে না। তুমি সবচেয়ে দয়ালু, আনন্দময় এবং স্বর্গীয় ব্যক্তি। তুমি আমার গর্ব এবং আনন্দ।',
            favoriteButton: () {},
            shareButton: () {Share.share('প্রিয়তমা, তোমার চেয়ে আমার আর কেউ থাকতে ভালোবাসে না। তুমি সবচেয়ে দয়ালু, আনন্দময় এবং স্বর্গীয় ব্যক্তি। তুমি আমার গর্ব এবং আনন্দ।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'প্রিয়তমা, তোমার চেয়ে আমার আর কেউ থাকতে ভালোবাসে না। তুমি সবচেয়ে দয়ালু, আনন্দময় এবং স্বর্গীয় ব্যক্তি। তুমি আমার গর্ব এবং আনন্দ।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমি তোমাকে ভালোবাসি - এইটুকুই আমি বলতে পারি। তোমার জন্য আমার প্রকৃত অনুভূতি প্রকাশ করার জন্য আমি আরও কিছু করতে পারতাম।',
            favoriteButton: () {},
            shareButton: () {Share.share('আমি তোমাকে ভালোবাসি - এইটুকুই আমি বলতে পারি। তোমার জন্য আমার প্রকৃত অনুভূতি প্রকাশ করার জন্য আমি আরও কিছু করতে পারতাম।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমি তোমাকে ভালোবাসি - এইটুকুই আমি বলতে পারি। তোমার জন্য আমার প্রকৃত অনুভূতি প্রকাশ করার জন্য আমি আরও কিছু করতে পারতাম।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমি জানি না আমি কতদিন বাঁচবো, কিন্তু আমি জানি প্রতিটি সেকেন্ড জীবনের জন্য মূল্যবান হবে কারণ এটি তোমার সাথে কাটানো হবে। আমি তোমাকে ভালোবাসি। 💗',
            favoriteButton: () {},
            shareButton: () {Share.share('আমি জানি না আমি কতদিন বাঁচবো, কিন্তু আমি জানি প্রতিটি সেকেন্ড জীবনের জন্য মূল্যবান হবে কারণ এটি তোমার সাথে কাটানো হবে। আমি তোমাকে ভালোবাসি। 💗');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমি জানি না আমি কতদিন বাঁচবো, কিন্তু আমি জানি প্রতিটি সেকেন্ড জীবনের জন্য মূল্যবান হবে কারণ এটি তোমার সাথে কাটানো হবে। আমি তোমাকে ভালোবাসি। 💗',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তুমি আমার আকাশের চাঁদ, আমার হৃদয়ের শান্তি, এবং আমার জীবনের ভালোবাসা। তোমাকে আমার জীবনে পেয়ে আমি ধন্য এবং চির কৃতজ্ঞ, সোনা!',
            favoriteButton: () {},
            shareButton: () {Share.share('তুমি আমার আকাশের চাঁদ, আমার হৃদয়ের শান্তি, এবং আমার জীবনের ভালোবাসা। তোমাকে আমার জীবনে পেয়ে আমি ধন্য এবং চির কৃতজ্ঞ, সোনা!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তুমি আমার আকাশের চাঁদ, আমার হৃদয়ের শান্তি, এবং আমার জীবনের ভালোবাসা। তোমাকে আমার জীবনে পেয়ে আমি ধন্য এবং চির কৃতজ্ঞ, সোনা!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার অপূর্ব মুখের দিকে যতবার তাকাই, তোমার ভালোবাসায় আমার হৃদয় গলে যায়। তোমার কথা ভাবা বন্ধ করতে পারছি না। আমি তোমাকে ভালোবাসি।',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমার অপূর্ব মুখের দিকে যতবার তাকাই, তোমার ভালোবাসায় আমার হৃদয় গলে যায়। তোমার কথা ভাবা বন্ধ করতে পারছি না। আমি তোমাকে ভালোবাসি।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমার অপূর্ব মুখের দিকে যতবার তাকাই, তোমার ভালোবাসায় আমার হৃদয় গলে যায়। তোমার কথা ভাবা বন্ধ করতে পারছি না। আমি তোমাকে ভালোবাসি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'যখনই আমার হৃদয় অস্থির হয়, তুমি তোমার ভালোবাসা এবং স্নেহ দিয়ে আমার আত্মাকে শান্ত করো। আমি তোমাকে ভালোবাসি, আমার অসাধারণ নারী।',
            favoriteButton: () {},
            shareButton: () {Share.share('যখনই আমার হৃদয় অস্থির হয়, তুমি তোমার ভালোবাসা এবং স্নেহ দিয়ে আমার আত্মাকে শান্ত করো। আমি তোমাকে ভালোবাসি, আমার অসাধারণ নারী।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'যখনই আমার হৃদয় অস্থির হয়, তুমি তোমার ভালোবাসা এবং স্নেহ দিয়ে আমার আত্মাকে শান্ত করো। আমি তোমাকে ভালোবাসি, আমার অসাধারণ নারী।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার সাথে, আমার সমস্ত দিন বেঁচে থাকার যোগ্য। তুমি আমার প্রার্থনার উত্তর এবং স্বপ্ন পূরণ। আমি তোমাকে ভালোবাসি! 💗',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমার সাথে, আমার সমস্ত দিন বেঁচে থাকার যোগ্য। তুমি আমার প্রার্থনার উত্তর এবং স্বপ্ন পূরণ। আমি তোমাকে ভালোবাসি! 💗');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমার সাথে, আমার সমস্ত দিন বেঁচে থাকার যোগ্য। তুমি আমার প্রার্থনার উত্তর এবং স্বপ্ন পূরণ। আমি তোমাকে ভালোবাসি! 💗',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমাকে বুকের কাছে ধরে রাখলে আমার সব দুশ্চিন্তা দূর হয়ে যায়। আমার জীবনে এত ভালোবাসা এবং শান্তি আনার জন্য ধন্যবাদ।',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমাকে বুকের কাছে ধরে রাখলে আমার সব দুশ্চিন্তা দূর হয়ে যায়। আমার জীবনে এত ভালোবাসা এবং শান্তি আনার জন্য ধন্যবাদ।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমাকে বুকের কাছে ধরে রাখলে আমার সব দুশ্চিন্তা দূর হয়ে যায়। আমার জীবনে এত ভালোবাসা এবং শান্তি আনার জন্য ধন্যবাদ।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'প্রতিটি মুহূর্ত, মিনিট, ঘন্টা, দিন, মাস, বছর এবং তার পরেও আমি তোমাকে আরও ভালোবাসি! তোমার প্রতি আমার ভালোবাসার কোন সীমা নেই!',
            favoriteButton: () {},
            shareButton: () {Share.share('প্রতিটি মুহূর্ত, মিনিট, ঘন্টা, দিন, মাস, বছর এবং তার পরেও আমি তোমাকে আরও ভালোবাসি! তোমার প্রতি আমার ভালোবাসার কোন সীমা নেই!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'প্রতিটি মুহূর্ত, মিনিট, ঘন্টা, দিন, মাস, বছর এবং তার পরেও আমি তোমাকে আরও ভালোবাসি! তোমার প্রতি আমার ভালোবাসার কোন সীমা নেই!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমাকে দেখলেই আমার হৃদয় গলে যায়। তোমার স্পর্শে আমার শরীর প্রশান্ত হয়ে ওঠে। শুধু একজন অসাধারণ স্ত্রীই নয়, একজন অসাধারণ বন্ধু হওয়ার জন্যও ধন্যবাদ।',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমাকে দেখলেই আমার হৃদয় গলে যায়। তোমার স্পর্শে আমার শরীর প্রশান্ত হয়ে ওঠে। শুধু একজন অসাধারণ স্ত্রীই নয়, একজন অসাধারণ বন্ধু হওয়ার জন্যও ধন্যবাদ।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমাকে দেখলেই আমার হৃদয় গলে যায়। তোমার স্পর্শে আমার শরীর প্রশান্ত হয়ে ওঠে। শুধু একজন অসাধারণ স্ত্রীই নয়, একজন অসাধারণ বন্ধু হওয়ার জন্যও ধন্যবাদ।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমার প্রিয় স্ত্রী, আমার হৃদয় কেবল তোমার ভালোবাসার জন্য আকুল। আমার জীবনে এমন একজন দেবদূত পেয়ে আমি ধন্য।',
            favoriteButton: () {},
            shareButton: () {Share.share('আমার প্রিয় স্ত্রী, আমার হৃদয় কেবল তোমার ভালোবাসার জন্য আকুল। আমার জীবনে এমন একজন দেবদূত পেয়ে আমি ধন্য।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমার প্রিয় স্ত্রী, আমার হৃদয় কেবল তোমার ভালোবাসার জন্য আকুল। আমার জীবনে এমন একজন দেবদূত পেয়ে আমি ধন্য।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার সাথে কাটানো প্রতিটি মুহূর্ত আমাকে আমাদের ভালোবাসার শক্তি উপলব্ধি করতে সাহায্য করে! আমার স্ত্রী, আমি তোমাকে ভালোবাসি, এখন এবং চিরকাল!',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমার সাথে কাটানো প্রতিটি মুহূর্ত আমাকে আমাদের ভালোবাসার শক্তি উপলব্ধি করতে সাহায্য করে! আমার স্ত্রী, আমি তোমাকে ভালোবাসি, এখন এবং চিরকাল!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমার সাথে কাটানো প্রতিটি মুহূর্ত আমাকে আমাদের ভালোবাসার শক্তি উপলব্ধি করতে সাহায্য করে! আমার স্ত্রী, আমি তোমাকে ভালোবাসি, এখন এবং চিরকাল!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমি এখন পর্যন্ত আমার কাজের বর্ণনা দিতে পারছি না, কিন্তু তোমাকে ভালোবাসাই আমার একমাত্র সঠিক কাজ। প্রিয় স্ত্রী, আমি তোমাকে হৃদয় দিয়ে ভালোবাসি।',
            favoriteButton: () {},
            shareButton: () {Share.share('আমি এখন পর্যন্ত আমার কাজের বর্ণনা দিতে পারছি না, কিন্তু তোমাকে ভালোবাসাই আমার একমাত্র সঠিক কাজ। প্রিয় স্ত্রী, আমি তোমাকে হৃদয় দিয়ে ভালোবাসি।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমি এখন পর্যন্ত আমার কাজের বর্ণনা দিতে পারছি না, কিন্তু তোমাকে ভালোবাসাই আমার একমাত্র সঠিক কাজ। প্রিয় স্ত্রী, আমি তোমাকে হৃদয় দিয়ে ভালোবাসি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমি জানি না আমার জীবন কতদিনের হবে, কিন্তু আমি জানি যে প্রতিটি সেকেন্ড জীবনের জন্য মূল্যবান হবে কারণ এটি তোমার সাথে কাটানো হবে।',
            favoriteButton: () {},
            shareButton: () {Share.share('আমি জানি না আমার জীবন কতদিনের হবে, কিন্তু আমি জানি যে প্রতিটি সেকেন্ড জীবনের জন্য মূল্যবান হবে কারণ এটি তোমার সাথে কাটানো হবে।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমি জানি না আমার জীবন কতদিনের হবে, কিন্তু আমি জানি যে প্রতিটি সেকেন্ড জীবনের জন্য মূল্যবান হবে কারণ এটি তোমার সাথে কাটানো হবে।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমাকে বিয়ে করার পর, আমি আর ঈশ্বরের কাছে কিছু চাইতে পারি না কারণ তুমি আমার প্রার্থনার উত্তর, সুন্দরী স্ত্রী।',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমাকে বিয়ে করার পর, আমি আর ঈশ্বরের কাছে কিছু চাইতে পারি না কারণ তুমি আমার প্রার্থনার উত্তর, সুন্দরী স্ত্রী।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমাকে বিয়ে করার পর, আমি আর ঈশ্বরের কাছে কিছু চাইতে পারি না কারণ তুমি আমার প্রার্থনার উত্তর, সুন্দরী স্ত্রী।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'ওয়াইন যেমন পুরনো হওয়ার সাথে সাথে মিষ্টি হয়, তেমনি বয়সের সাথে সাথে তুমিও সুন্দর হতে থাকো। যতই দিন যাচ্ছে, আমি ততই তোমার প্রেমে পড়ছি।',
            favoriteButton: () {},
            shareButton: () {Share.share('ওয়াইন যেমন পুরনো হওয়ার সাথে সাথে মিষ্টি হয়, তেমনি বয়সের সাথে সাথে তুমিও সুন্দর হতে থাকো। যতই দিন যাচ্ছে, আমি ততই তোমার প্রেমে পড়ছি।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'ওয়াইন যেমন পুরনো হওয়ার সাথে সাথে মিষ্টি হয়, তেমনি বয়সের সাথে সাথে তুমিও সুন্দর হতে থাকো। যতই দিন যাচ্ছে, আমি ততই তোমার প্রেমে পড়ছি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তুমি যখন আমার হয়েছিলে, তখন আমার সব প্রার্থনা সত্যি হয়ে গিয়েছিল। চিরকাল তোমার সাথে থাকা ছাড়া আর কিছুই চাও না।',
            favoriteButton: () {},
            shareButton: () {Share.share('তুমি যখন আমার হয়েছিলে, তখন আমার সব প্রার্থনা সত্যি হয়ে গিয়েছিল। চিরকাল তোমার সাথে থাকা ছাড়া আর কিছুই চাও না।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তুমি যখন আমার হয়েছিলে, তখন আমার সব প্রার্থনা সত্যি হয়ে গিয়েছিল। চিরকাল তোমার সাথে থাকা ছাড়া আর কিছুই চাও না।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমি ইতিমধ্যে অসংখ্যবার তোমার ব্যক্তিত্ব এবং সৌন্দর্যের প্রেমে পড়েছি, এবং আমি কখনও তোমার প্রেমে পড়া বন্ধ করতে চাই না।',
            favoriteButton: () {},
            shareButton: () {Share.share('আমি ইতিমধ্যে অসংখ্যবার তোমার ব্যক্তিত্ব এবং সৌন্দর্যের প্রেমে পড়েছি, এবং আমি কখনও তোমার প্রেমে পড়া বন্ধ করতে চাই না।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমি ইতিমধ্যে অসংখ্যবার তোমার ব্যক্তিত্ব এবং সৌন্দর্যের প্রেমে পড়েছি, এবং আমি কখনও তোমার প্রেমে পড়া বন্ধ করতে চাই না।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমি যেখানেই যাই, তোমার ভালোবাসা আমার হৃদয়ে বহন করি। তোমার কোলে ফিরে আসার জন্য দিন গুনছি, আমার প্রিয়।',
            favoriteButton: () {},
            shareButton: () {Share.share('আমি যেখানেই যাই, তোমার ভালোবাসা আমার হৃদয়ে বহন করি। তোমার কোলে ফিরে আসার জন্য দিন গুনছি, আমার প্রিয়।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমি যেখানেই যাই, তোমার ভালোবাসা আমার হৃদয়ে বহন করি। তোমার কোলে ফিরে আসার জন্য দিন গুনছি, আমার প্রিয়।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমাদের মধ্যে দূরত্ব আমাকে কেবল বুঝতে দিচ্ছে যে আমি তোমার প্রেমে কতটা পাগল। আমার সুন্দরী মহিলাকে আলিঙ্গন এবং চুম্বন পাঠাচ্ছি!',
            favoriteButton: () {},
            shareButton: () {Share.share('আমাদের মধ্যে দূরত্ব আমাকে কেবল বুঝতে দিচ্ছে যে আমি তোমার প্রেমে কতটা পাগল। আমার সুন্দরী মহিলাকে আলিঙ্গন এবং চুম্বন পাঠাচ্ছি!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমাদের মধ্যে দূরত্ব আমাকে কেবল বুঝতে দিচ্ছে যে আমি তোমার প্রেমে কতটা পাগল। আমার সুন্দরী মহিলাকে আলিঙ্গন এবং চুম্বন পাঠাচ্ছি!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমার কাছে, তোমাকে ভালোবাসা সবচেয়ে সুন্দর অনুভূতি; দয়া করে শীঘ্রই ফিরে এসো, আমার স্ত্রী।',
            favoriteButton: () {},
            shareButton: () {Share.share('আমার কাছে, তোমাকে ভালোবাসা সবচেয়ে সুন্দর অনুভূতি; দয়া করে শীঘ্রই ফিরে এসো, আমার স্ত্রী।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমার কাছে, তোমাকে ভালোবাসা সবচেয়ে সুন্দর অনুভূতি; দয়া করে শীঘ্রই ফিরে এসো, আমার স্ত্রী।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'প্রতিদিন সকালে ঘুম থেকে ওঠা আমার পাশে তোমাকে না দেখে কষ্ট হয়। কিন্তু তুমিই আমার ঘুম ভাঙানোর কারণ, শীঘ্রই তোমার সাথে দেখা করার আশায়। তোমাকে খুব মিস করছি, স্ত্রী।',
            favoriteButton: () {},
            shareButton: () {Share.share('প্রতিদিন সকালে ঘুম থেকে ওঠা আমার পাশে তোমাকে না দেখে কষ্ট হয়। কিন্তু তুমিই আমার ঘুম ভাঙানোর কারণ, শীঘ্রই তোমার সাথে দেখা করার আশায়। তোমাকে খুব মিস করছি, স্ত্রী।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'প্রতিদিন সকালে ঘুম থেকে ওঠা আমার পাশে তোমাকে না দেখে কষ্ট হয়। কিন্তু তুমিই আমার ঘুম ভাঙানোর কারণ, শীঘ্রই তোমার সাথে দেখা করার আশায়। তোমাকে খুব মিস করছি, স্ত্রী।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'এই কথাগুলোর মাধ্যমে, আমি তোমাকে আমার সমস্ত ভালোবাসা পাঠাচ্ছি। আমি তোমাকে আবার ধরে না রাখা পর্যন্ত এই ভালোবাসা তোমার হৃদয়ে সুরক্ষিত রাখো।',
            favoriteButton: () {},
            shareButton: () {Share.share('এই কথাগুলোর মাধ্যমে, আমি তোমাকে আমার সমস্ত ভালোবাসা পাঠাচ্ছি। আমি তোমাকে আবার ধরে না রাখা পর্যন্ত এই ভালোবাসা তোমার হৃদয়ে সুরক্ষিত রাখো।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'এই কথাগুলোর মাধ্যমে, আমি তোমাকে আমার সমস্ত ভালোবাসা পাঠাচ্ছি। আমি তোমাকে আবার ধরে না রাখা পর্যন্ত এই ভালোবাসা তোমার হৃদয়ে সুরক্ষিত রাখো।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তুমি আমার আকাশের সেই সূর্য আর চাঁদ যা আমার বিষণ্ণ দিনকে আলোকিত করতে কখনও ব্যর্থ হয় না! আমি তোমাকে ভালোবাসি, প্রিয় স্ত্রী।',
            favoriteButton: () {},
            shareButton: () {Share.share('তুমি আমার আকাশের সেই সূর্য আর চাঁদ যা আমার বিষণ্ণ দিনকে আলোকিত করতে কখনও ব্যর্থ হয় না! আমি তোমাকে ভালোবাসি, প্রিয় স্ত্রী।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তুমি আমার আকাশের সেই সূর্য আর চাঁদ যা আমার বিষণ্ণ দিনকে আলোকিত করতে কখনও ব্যর্থ হয় না! আমি তোমাকে ভালোবাসি, প্রিয় স্ত্রী।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমি যদি মোবাইল ফোন হতাম, তুমি চার্জার হতে। তোমাকে ছাড়া আমি অচল হয়ে যেতাম। আমি তোমাকে ভালোবাসি।',
            favoriteButton: () {},
            shareButton: () {Share.share('আমি যদি মোবাইল ফোন হতাম, তুমি চার্জার হতে। তোমাকে ছাড়া আমি অচল হয়ে যেতাম। আমি তোমাকে ভালোবাসি।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমি যদি মোবাইল ফোন হতাম, তুমি চার্জার হতে। তোমাকে ছাড়া আমি অচল হয়ে যেতাম। আমি তোমাকে ভালোবাসি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমি আমার হৃদস্পন্দন এত দ্রুত অনুভব করতে পারছি। মানুষ ভাবে আমি পাগল হয়ে গেছি, আর তাই আমিও। তোমার প্রেমে আমি পাগল, আমার স্ত্রী।',
            favoriteButton: () {},
            shareButton: () {Share.share('আমি আমার হৃদস্পন্দন এত দ্রুত অনুভব করতে পারছি। মানুষ ভাবে আমি পাগল হয়ে গেছি, আর তাই আমিও। তোমার প্রেমে আমি পাগল, আমার স্ত্রী।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমি আমার হৃদস্পন্দন এত দ্রুত অনুভব করতে পারছি। মানুষ ভাবে আমি পাগল হয়ে গেছি, আর তাই আমিও। তোমার প্রেমে আমি পাগল, আমার স্ত্রী।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমাকে আমার স্ত্রী হিসেবে পেয়ে আমি খুবই কৃতজ্ঞ। আমি তোমাকে অনেক ভালোবাসি!',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমাকে আমার স্ত্রী হিসেবে পেয়ে আমি খুবই কৃতজ্ঞ। আমি তোমাকে অনেক ভালোবাসি!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমাকে আমার স্ত্রী হিসেবে পেয়ে আমি খুবই কৃতজ্ঞ। আমি তোমাকে অনেক ভালোবাসি!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তুমি সবচেয়ে সুন্দর ফুল, আর তোমার হাসি আমার পৃথিবীকে রঙিন করে তোলে। তোমাকে ভালোবাসি, প্রিয় স্ত্রী।',
            favoriteButton: () {},
            shareButton: () {Share.share('তুমি সবচেয়ে সুন্দর ফুল, আর তোমার হাসি আমার পৃথিবীকে রঙিন করে তোলে। তোমাকে ভালোবাসি, প্রিয় স্ত্রী।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তুমি সবচেয়ে সুন্দর ফুল, আর তোমার হাসি আমার পৃথিবীকে রঙিন করে তোলে। তোমাকে ভালোবাসি, প্রিয় স্ত্রী।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার সাথে আমার জীবন ভাগাভাগি করে নিতে আমার খুব ভালো লাগে। তোমার স্বামী হতে পারাটা আমার জন্য আশীর্বাদের।',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমার সাথে আমার জীবন ভাগাভাগি করে নিতে আমার খুব ভালো লাগে। তোমার স্বামী হতে পারাটা আমার জন্য আশীর্বাদের।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমার সাথে আমার জীবন ভাগাভাগি করে নিতে আমার খুব ভালো লাগে। তোমার স্বামী হতে পারাটা আমার জন্য আশীর্বাদের।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তুমি আমার এতটাই অবিচ্ছেদ্য অংশ হয়ে গেছো যে তোমাকে ছাড়া আমি একটা দিনও কাটানোর কথা কল্পনাও করতে পারি না।',
            favoriteButton: () {},
            shareButton: () {Share.share('তুমি আমার এতটাই অবিচ্ছেদ্য অংশ হয়ে গেছো যে তোমাকে ছাড়া আমি একটা দিনও কাটানোর কথা কল্পনাও করতে পারি না।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তুমি আমার এতটাই অবিচ্ছেদ্য অংশ হয়ে গেছো যে তোমাকে ছাড়া আমি একটা দিনও কাটানোর কথা কল্পনাও করতে পারি না।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমাকে একজন দেবদূতের সাথে তুলনা করা যেতে পারে, কিন্তু তোমার রাগ কখনোই কারো সাথে তুলনা করা যাবে না। 🤣 তবুও, তুমিই সেরা! 😍',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমাকে একজন দেবদূতের সাথে তুলনা করা যেতে পারে, কিন্তু তোমার রাগ কখনোই কারো সাথে তুলনা করা যাবে না। 🤣 তবুও, তুমিই সেরা! 😍');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমাকে একজন দেবদূতের সাথে তুলনা করা যেতে পারে, কিন্তু তোমার রাগ কখনোই কারো সাথে তুলনা করা যাবে না। 🤣 তবুও, তুমিই সেরা! 😍',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমরা হয়তো ভিন্ন আকাশের নিচে থাকি, কিন্তু সে এখনও আমার প্রতিদিনের প্রথম এবং শেষ চিন্তা।',
            favoriteButton: () {},
            shareButton: () {Share.share('আমরা হয়তো ভিন্ন আকাশের নিচে থাকি, কিন্তু সে এখনও আমার প্রতিদিনের প্রথম এবং শেষ চিন্তা।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমরা হয়তো ভিন্ন আকাশের নিচে থাকি, কিন্তু সে এখনও আমার প্রতিদিনের প্রথম এবং শেষ চিন্তা।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'সে শুধু আমার স্ত্রী নয়। সে আমাদের ঘরের হৃদয় এবং আমাদের বাচ্চাদের হাসির জাদু।',
            favoriteButton: () {},
            shareButton: () {Share.share('সে শুধু আমার স্ত্রী নয়। সে আমাদের ঘরের হৃদয় এবং আমাদের বাচ্চাদের হাসির জাদু।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'সে শুধু আমার স্ত্রী নয়। সে আমাদের ঘরের হৃদয় এবং আমাদের বাচ্চাদের হাসির জাদু।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'পৃথিবীর যেকোনো জায়গা আমার কাছে নিজের জায়গা মনে হবে যতক্ষণ তুমি আমার সাথে থাকবে। আমি তোমাকে আমার জীবন এবং এই পৃথিবীর সবকিছুর চেয়েও বেশি ভালোবাসি!',
            favoriteButton: () {},
            shareButton: () {Share.share('পৃথিবীর যেকোনো জায়গা আমার কাছে নিজের জায়গা মনে হবে যতক্ষণ তুমি আমার সাথে থাকবে। আমি তোমাকে আমার জীবন এবং এই পৃথিবীর সবকিছুর চেয়েও বেশি ভালোবাসি!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'পৃথিবীর যেকোনো জায়গা আমার কাছে নিজের জায়গা মনে হবে যতক্ষণ তুমি আমার সাথে থাকবে। আমি তোমাকে আমার জীবন এবং এই পৃথিবীর সবকিছুর চেয়েও বেশি ভালোবাসি!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'পৃথিবীর যেকোনো জায়গা আমার কাছে নিজের জায়গা মনে হবে যতক্ষণ তুমি আমার সাথে থাকবে। আমি তোমাকে আমার জীবন এবং এই পৃথিবীর সবকিছুর চেয়েও বেশি ভালোবাসি!',
            favoriteButton: () {},
            shareButton: () {Share.share('পৃথিবীর যেকোনো জায়গা আমার কাছে নিজের জায়গা মনে হবে যতক্ষণ তুমি আমার সাথে থাকবে। আমি তোমাকে আমার জীবন এবং এই পৃথিবীর সবকিছুর চেয়েও বেশি ভালোবাসি!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'পৃথিবীর যেকোনো জায়গা আমার কাছে নিজের জায়গা মনে হবে যতক্ষণ তুমি আমার সাথে থাকবে। আমি তোমাকে আমার জীবন এবং এই পৃথিবীর সবকিছুর চেয়েও বেশি ভালোবাসি!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমি কেবল আমার জীবনের ভালোবাসাকেই বিয়ে করিনি; আমি আমার শান্তি, আমার সঙ্গী এবং আমার সবচেয়ে বড় আশীর্বাদকে বিয়ে করেছি।',
            favoriteButton: () {},
            shareButton: () {Share.share('আমি কেবল আমার জীবনের ভালোবাসাকেই বিয়ে করিনি; আমি আমার শান্তি, আমার সঙ্গী এবং আমার সবচেয়ে বড় আশীর্বাদকে বিয়ে করেছি।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমি কেবল আমার জীবনের ভালোবাসাকেই বিয়ে করিনি; আমি আমার শান্তি, আমার সঙ্গী এবং আমার সবচেয়ে বড় আশীর্বাদকে বিয়ে করেছি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'প্রতিদিন তোমার পাশে ঘুম থেকে ওঠা আমার জীবনের সবচেয়ে বড় আশীর্বাদ। তুমিই আমার পুরো পৃথিবী, সোনা। 💗',
            favoriteButton: () {},
            shareButton: () {Share.share('প্রতিদিন তোমার পাশে ঘুম থেকে ওঠা আমার জীবনের সবচেয়ে বড় আশীর্বাদ। তুমিই আমার পুরো পৃথিবী, সোনা। 💗');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'প্রতিদিন তোমার পাশে ঘুম থেকে ওঠা আমার জীবনের সবচেয়ে বড় আশীর্বাদ। তুমিই আমার পুরো পৃথিবী, সোনা। 💗',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার জন্যই এই বছরগুলো আমার জীবনের সবচেয়ে আনন্দের মুহূর্ত ছিল। তোমার যত্ন এবং স্নেহের জন্য ধন্যবাদ। তোমাকে ভালোবাসা পৃথিবীর সেরা অনুভূতিগুলির মধ্যে একটি।',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমার জন্যই এই বছরগুলো আমার জীবনের সবচেয়ে আনন্দের মুহূর্ত ছিল। তোমার যত্ন এবং স্নেহের জন্য ধন্যবাদ। তোমাকে ভালোবাসা পৃথিবীর সেরা অনুভূতিগুলির মধ্যে একটি।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমার জন্যই এই বছরগুলো আমার জীবনের সবচেয়ে আনন্দের মুহূর্ত ছিল। তোমার যত্ন এবং স্নেহের জন্য ধন্যবাদ। তোমাকে ভালোবাসা পৃথিবীর সেরা অনুভূতিগুলির মধ্যে একটি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তুমি পৃথিবীর সবচেয়ে দয়ালু, মজাদার, বুদ্ধিমতী এবং সবচেয়ে সুন্দরী নারী। তোমার স্বামী হতে পেরে আমি নিজেকে অনেক ভাগ্যবান মনে করি!',
            favoriteButton: () {},
            shareButton: () {Share.share('তুমি পৃথিবীর সবচেয়ে দয়ালু, মজাদার, বুদ্ধিমতী এবং সবচেয়ে সুন্দরী নারী। তোমার স্বামী হতে পেরে আমি নিজেকে অনেক ভাগ্যবান মনে করি!');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তুমি পৃথিবীর সবচেয়ে দয়ালু, মজাদার, বুদ্ধিমতী এবং সবচেয়ে সুন্দরী নারী। তোমার স্বামী হতে পেরে আমি নিজেকে অনেক ভাগ্যবান মনে করি!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার ভালোবাসা, সমর্থন এবং যত্ন আমাকে আমার মতো মানুষ করে তুলেছে, এবং আমি সবসময় তোমার যোগ্য হতে চেষ্টা করব।',
            favoriteButton: () {},
            shareButton: () {Share.share('তোমার ভালোবাসা, সমর্থন এবং যত্ন আমাকে আমার মতো মানুষ করে তুলেছে, এবং আমি সবসময় তোমার যোগ্য হতে চেষ্টা করব।');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'তোমার ভালোবাসা, সমর্থন এবং যত্ন আমাকে আমার মতো মানুষ করে তুলেছে, এবং আমি সবসময় তোমার যোগ্য হতে চেষ্টা করব।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমরা একে অপরের থেকে যত দূরেই থাকি না কেন, জেনে রেখো আমি সবসময় তোমারই থাকব। তোমাকে ভালোবাসি, সোনা। 💗',
            favoriteButton: () {},
            shareButton: () {Share.share('আমরা একে অপরের থেকে যত দূরেই থাকি না কেন, জেনে রেখো আমি সবসময় তোমারই থাকব। তোমাকে ভালোবাসি, সোনা। 💗');},
            copyButton: () {
              Clipboard.setData(
                ClipboardData(
                  text: 'আমরা একে অপরের থেকে যত দূরেই থাকি না কেন, জেনে রেখো আমি সবসময় তোমারই থাকব। তোমাকে ভালোবাসি, সোনা। 💗',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
        ],
      ),
    );
  }
}
