import 'package:clipboard/clipboard.dart';
import 'package:flutter/material.dart';
import 'package:share_plus/share_plus.dart';
import 'package:wish_message_app/features/common/read_sms.dart';

class FarewellSms extends StatelessWidget {
  const FarewellSms({
    super.key,
  });

  @override
  Widget build(BuildContext context) {
    return Padding(
      padding: const EdgeInsets.all(16),
      child: Column(
        children: [
          Column(
            children: [
              ReadSms(
                message: 'তোমার জীবনের নতুন অধ্যায়ের জন্য আমার শুভেচ্ছা। তোমার অভাব বোধ হবে। বিদায়!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার জীবনের নতুন অধ্যায়ের জন্য আমার শুভেচ্ছা। তোমার অভাব বোধ হবে। বিদায়!');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার জীবনের নতুন অধ্যায়ের জন্য আমার শুভেচ্ছা। তোমার অভাব বোধ হবে। বিদায়!');
                },
              ),
              ReadSms(
                message: 'আমি সবসময় তোমার প্রশংসা করেছি এবং তুমি যা আছো তার জন্যই থাকবো। তোমার এগিয়ে যাওয়ার জন্য শুভকামনা রইল!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('আমি সবসময় তোমার প্রশংসা করেছি এবং তুমি যা আছো তার জন্যই থাকবো। তোমার এগিয়ে যাওয়ার জন্য শুভকামনা রইল!');
                },
                copyButton: (){
                  FlutterClipboard.copy('আমি সবসময় তোমার প্রশংসা করেছি এবং তুমি যা আছো তার জন্যই থাকবো। তোমার এগিয়ে যাওয়ার জন্য শুভকামনা রইল!');
                },
              ),
              ReadSms(
                message: 'তোমার মতো একজনের সাথে কাজ করতে পেরে আমি নিজেকে ভাগ্যবান মনে করছি - সহায়ক, জ্ঞানী এবং সর্বদা সদয়। বিদায়, এবং পরবর্তী কাজের জন্য শুভকামনা।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার মতো একজনের সাথে কাজ করতে পেরে আমি নিজেকে ভাগ্যবান মনে করছি - সহায়ক, জ্ঞানী এবং সর্বদা সদয়। বিদায়, এবং পরবর্তী কাজের জন্য শুভকামনা।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার মতো একজনের সাথে কাজ করতে পেরে আমি নিজেকে ভাগ্যবান মনে করছি - সহায়ক, জ্ঞানী এবং সর্বদা সদয়। বিদায়, এবং পরবর্তী কাজের জন্য শুভকামনা।');
                },
              ),
              ReadSms(
                message: 'তুমি আমার দেখা সেরা মানুষদের মধ্যে একজন। নতুন জীবনের জন্য শুভকামনা এবং বিদায়!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তুমি আমার দেখা সেরা মানুষদের মধ্যে একজন। নতুন জীবনের জন্য শুভকামনা এবং বিদায়!');
                },
                copyButton: (){
                  FlutterClipboard.copy('তুমি আমার দেখা সেরা মানুষদের মধ্যে একজন। নতুন জীবনের জন্য শুভকামনা এবং বিদায়!');
                },
              ),
              ReadSms(
                message: 'বিদায় জানানো সহজ নয়, কিন্তু কোনও কিছুর কারণে যেন পিছিয়ে না পড়ে। তোমার সামনে সুন্দর দিন আসছে। বিদায়, শীঘ্রই দেখা হবে!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('বিদায় জানানো সহজ নয়, কিন্তু কোনও কিছুর কারণে যেন পিছিয়ে না পড়ে। তোমার সামনে সুন্দর দিন আসছে। বিদায়, শীঘ্রই দেখা হবে!');
                },
                copyButton: (){
                  FlutterClipboard.copy('বিদায় জানানো সহজ নয়, কিন্তু কোনও কিছুর কারণে যেন পিছিয়ে না পড়ে। তোমার সামনে সুন্দর দিন আসছে। বিদায়, শীঘ্রই দেখা হবে!');
                },
              ),
              ReadSms(
                message: 'তোমার মতো সহকর্মীর বিদায় তিক্ত-মিষ্টি। তোমার ভবিষ্যতের প্রচেষ্টার জন্য শুভকামনা, এগুলো তোমাকে অনেক সাফল্য এবং সন্তুষ্টি এনে দিক। বিদায়।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার মতো সহকর্মীর বিদায় তিক্ত-মিষ্টি। তোমার ভবিষ্যতের প্রচেষ্টার জন্য শুভকামনা, এগুলো তোমাকে অনেক সাফল্য এবং সন্তুষ্টি এনে দিক। বিদায়।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার মতো সহকর্মীর বিদায় তিক্ত-মিষ্টি। তোমার ভবিষ্যতের প্রচেষ্টার জন্য শুভকামনা, এগুলো তোমাকে অনেক সাফল্য এবং সন্তুষ্টি এনে দিক। বিদায়।');
                },
              ),
              ReadSms(
                message: 'শুভ বিদায়! আজ তুমি আমাদের ছেড়ে চলে যাচ্ছো অসংখ্য স্মৃতি নিয়ে। আমরা সবাই তোমার অভাব বোধ করব। তোমার নতুন গন্তব্যে যাত্রা শুভ হোক!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('শুভ বিদায়! আজ তুমি আমাদের ছেড়ে চলে যাচ্ছো অসংখ্য স্মৃতি নিয়ে। আমরা সবাই তোমার অভাব বোধ করব। তোমার নতুন গন্তব্যে যাত্রা শুভ হোক!');
                },
                copyButton: (){
                  FlutterClipboard.copy('শুভ বিদায়! আজ তুমি আমাদের ছেড়ে চলে যাচ্ছো অসংখ্য স্মৃতি নিয়ে। আমরা সবাই তোমার অভাব বোধ করব। তোমার নতুন গন্তব্যে যাত্রা শুভ হোক!');
                },
              ),
              ReadSms(
                message: 'কোম্পানিতে আরও মূল্য সংযোজন এবং এটিকে আরও ভালোভাবে গঠনে সাহায্য করার জন্য আপনাকে ধন্যবাদ। আপনার আগামীর যাত্রা আরও উদ্দেশ্য এবং সুখে পরিপূর্ণ হোক।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('কোম্পানিতে আরও মূল্য সংযোজন এবং এটিকে আরও ভালোভাবে গঠনে সাহায্য করার জন্য আপনাকে ধন্যবাদ। আপনার আগামীর যাত্রা আরও উদ্দেশ্য এবং সুখে পরিপূর্ণ হোক।');
                },
                copyButton: (){
                  FlutterClipboard.copy('কোম্পানিতে আরও মূল্য সংযোজন এবং এটিকে আরও ভালোভাবে গঠনে সাহায্য করার জন্য আপনাকে ধন্যবাদ। আপনার আগামীর যাত্রা আরও উদ্দেশ্য এবং সুখে পরিপূর্ণ হোক।');
                },
              ),
              ReadSms(
                message: 'তোমার চলে যাওয়া দেখে আমি দুঃখিত, কিন্তু তুমি যে নতুন পদক্ষেপ নিচ্ছ তাতে আমি গর্বিত। আমার যাত্রার অংশ হওয়ার জন্য তোমাকে ধন্যবাদ। তোমাকে খুব মিস করব।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার চলে যাওয়া দেখে আমি দুঃখিত, কিন্তু তুমি যে নতুন পদক্ষেপ নিচ্ছ তাতে আমি গর্বিত। আমার যাত্রার অংশ হওয়ার জন্য তোমাকে ধন্যবাদ। তোমাকে খুব মিস করব।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার চলে যাওয়া দেখে আমি দুঃখিত, কিন্তু তুমি যে নতুন পদক্ষেপ নিচ্ছ তাতে আমি গর্বিত। আমার যাত্রার অংশ হওয়ার জন্য তোমাকে ধন্যবাদ। তোমাকে খুব মিস করব।');
                },
              ),
              ReadSms(
                message: 'আপনার নির্দেশনায় কাজ করাটা সম্মানের ছিল, স্যার/ম্যাডাম। আপনার চলে যাওয়া দেখে আমার মন খারাপ। আপনাকে বিদায়।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('আপনার নির্দেশনায় কাজ করাটা সম্মানের ছিল, স্যার/ম্যাডাম। আপনার চলে যাওয়া দেখে আমার মন খারাপ। আপনাকে বিদায়।');
                },
                copyButton: (){
                  FlutterClipboard.copy('আপনার নির্দেশনায় কাজ করাটা সম্মানের ছিল, স্যার/ম্যাডাম। আপনার চলে যাওয়া দেখে আমার মন খারাপ। আপনাকে বিদায়।');
                },
              ),
              ReadSms(
                message: 'এই বিদায় তোমার সুন্দর জীবনের শুরু হোক। ধন্য হও এবং বেড়ে উঠো।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('এই বিদায় তোমার সুন্দর জীবনের শুরু হোক। ধন্য হও এবং বেড়ে উঠো।');
                },
                copyButton: (){
                  FlutterClipboard.copy('এই বিদায় তোমার সুন্দর জীবনের শুরু হোক। ধন্য হও এবং বেড়ে উঠো।');
                },
              ),
              ReadSms(
                message: 'আমাদের যত্ন নেওয়ার জন্য এবং আপনার আশেপাশে আমাদের নিরাপদ বোধ করানোর জন্য আপনাকে ধন্যবাদ! আমরা আপনাকে অনেক মিস করব, দয়া করে যোগাযোগ রাখুন!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('আমাদের যত্ন নেওয়ার জন্য এবং আপনার আশেপাশে আমাদের নিরাপদ বোধ করানোর জন্য আপনাকে ধন্যবাদ! আমরা আপনাকে অনেক মিস করব, দয়া করে যোগাযোগ রাখুন!');
                },
                copyButton: (){
                  FlutterClipboard.copy('আমাদের যত্ন নেওয়ার জন্য এবং আপনার আশেপাশে আমাদের নিরাপদ বোধ করানোর জন্য আপনাকে ধন্যবাদ! আমরা আপনাকে অনেক মিস করব, দয়া করে যোগাযোগ রাখুন!');
                },
              ),
              ReadSms(
                message: 'কিছু বিদায় খুব কঠিন কারণ স্মৃতিগুলো খুব ভালো ছিল। আমার গল্পের অংশ হওয়ার জন্য ধন্যবাদ। বিদায়, আমার বন্ধু।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('কিছু বিদায় খুব কঠিন কারণ স্মৃতিগুলো খুব ভালো ছিল। আমার গল্পের অংশ হওয়ার জন্য ধন্যবাদ। বিদায়, আমার বন্ধু।');
                },
                copyButton: (){
                  FlutterClipboard.copy('কিছু বিদায় খুব কঠিন কারণ স্মৃতিগুলো খুব ভালো ছিল। আমার গল্পের অংশ হওয়ার জন্য ধন্যবাদ। বিদায়, আমার বন্ধু।');
                },
              ),
              ReadSms(
                message: 'আমি তোমাদের সকলের জন্য শুভকামনা জানাই কারণ এটাই তোমাদের প্রাপ্য! আমরা শীঘ্রই আবার দেখা করব। নিজের যত্ন নিও।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('আমি তোমাদের সকলের জন্য শুভকামনা জানাই কারণ এটাই তোমাদের প্রাপ্য! আমরা শীঘ্রই আবার দেখা করব। নিজের যত্ন নিও।');
                },
                copyButton: (){
                  FlutterClipboard.copy('আমি তোমাদের সকলের জন্য শুভকামনা জানাই কারণ এটাই তোমাদের প্রাপ্য! আমরা শীঘ্রই আবার দেখা করব। নিজের যত্ন নিও।');
                },
              ),
              ReadSms(
                message: 'বিদায় প্রিয়। তুমি আমাদের সাথে থাকো বা না থাকো তাতে কিছু যায় আসে না, তোমার কাজ সবসময় এই অফিসের প্রতিটি ব্যক্তিকে অনুপ্রাণিত করবে। তোমার জন্য শুভকামনা!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('বিদায় প্রিয়। তুমি আমাদের সাথে থাকো বা না থাকো তাতে কিছু যায় আসে না, তোমার কাজ সবসময় এই অফিসের প্রতিটি ব্যক্তিকে অনুপ্রাণিত করবে। তোমার জন্য শুভকামনা!');
                },
                copyButton: (){
                  FlutterClipboard.copy('বিদায় প্রিয়। তুমি আমাদের সাথে থাকো বা না থাকো তাতে কিছু যায় আসে না, তোমার কাজ সবসময় এই অফিসের প্রতিটি ব্যক্তিকে অনুপ্রাণিত করবে। তোমার জন্য শুভকামনা!');
                },
              ),
              ReadSms(
                message: 'তুমি এমন একজন কর্মচারী যেটা যেকোনো বস তার অফিসে রাখতে চান। তুমি যে আরও বড় জায়গায় যাচ্ছো তাতে অবাক হওয়ার কিছু নেই। তোমার জন্য শুভকামনা!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তুমি এমন একজন কর্মচারী যেটা যেকোনো বস তার অফিসে রাখতে চান। তুমি যে আরও বড় জায়গায় যাচ্ছো তাতে অবাক হওয়ার কিছু নেই। তোমার জন্য শুভকামনা!');
                },
                copyButton: (){
                  FlutterClipboard.copy('তুমি এমন একজন কর্মচারী যেটা যেকোনো বস তার অফিসে রাখতে চান। তুমি যে আরও বড় জায়গায় যাচ্ছো তাতে অবাক হওয়ার কিছু নেই। তোমার জন্য শুভকামনা!');
                },
              ),
              ReadSms(
                message: 'তোমাদের সকলকে বিদায়। তোমাদের সাথে থাকতে পেরে আনন্দিত হলাম। তোমাদের আগামীর যাত্রা নিরাপদ হোক। ঈশ্বর তোমাদের মঙ্গল করুন এবং তোমাদের সাথেই থাকুন।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমাদের সকলকে বিদায়। তোমাদের সাথে থাকতে পেরে আনন্দিত হলাম। তোমাদের আগামীর যাত্রা নিরাপদ হোক। ঈশ্বর তোমাদের মঙ্গল করুন এবং তোমাদের সাথেই থাকুন।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমাদের সকলকে বিদায়। তোমাদের সাথে থাকতে পেরে আনন্দিত হলাম। তোমাদের আগামীর যাত্রা নিরাপদ হোক। ঈশ্বর তোমাদের মঙ্গল করুন এবং তোমাদের সাথেই থাকুন।');
                },
              ),
              ReadSms(
                message: 'আপনার তত্ত্বাবধানে কাজ করতে পেরে আমরা নিজেকে ভাগ্যবান মনে করছি। আপনার নির্দেশনা আমাদের প্রত্যেকেরই প্রতিদিন মনে পড়বে। বিদায়, স্যার!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('আপনার তত্ত্বাবধানে কাজ করতে পেরে আমরা নিজেকে ভাগ্যবান মনে করছি। আপনার নির্দেশনা আমাদের প্রত্যেকেরই প্রতিদিন মনে পড়বে। বিদায়, স্যার!');
                },
                copyButton: (){
                  FlutterClipboard.copy('আপনার তত্ত্বাবধানে কাজ করতে পেরে আমরা নিজেকে ভাগ্যবান মনে করছি। আপনার নির্দেশনা আমাদের প্রত্যেকেরই প্রতিদিন মনে পড়বে। বিদায়, স্যার!');
                },
              ),
              ReadSms(
                message: 'তুমি যেখানেই যাও না কেন, আমরা সবসময় আমাদের হৃদয়ে সংযুক্ত থাকব। আমার আন্তরিক শুভেচ্ছা সবসময় তোমার সাথে থাকবে। বিদায় প্রিয় বন্ধু!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তুমি যেখানেই যাও না কেন, আমরা সবসময় আমাদের হৃদয়ে সংযুক্ত থাকব। আমার আন্তরিক শুভেচ্ছা সবসময় তোমার সাথে থাকবে। বিদায় প্রিয় বন্ধু!');
                },
                copyButton: (){
                  FlutterClipboard.copy('তুমি যেখানেই যাও না কেন, আমরা সবসময় আমাদের হৃদয়ে সংযুক্ত থাকব। আমার আন্তরিক শুভেচ্ছা সবসময় তোমার সাথে থাকবে। বিদায় প্রিয় বন্ধু!');
                },
              ),
              ReadSms(
                message: 'তুমি কেবল একজন মহান শিক্ষকই নও, একজন মহান মানুষও। তোমার কাছ থেকে আমরা অনেক কিছু শিখেছি! তুমি সেরা বিদায়ের যোগ্য!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তুমি কেবল একজন মহান শিক্ষকই নও, একজন মহান মানুষও। তোমার কাছ থেকে আমরা অনেক কিছু শিখেছি! তুমি সেরা বিদায়ের যোগ্য!');
                },
                copyButton: (){
                  FlutterClipboard.copy('তুমি কেবল একজন মহান শিক্ষকই নও, একজন মহান মানুষও। তোমার কাছ থেকে আমরা অনেক কিছু শিখেছি! তুমি সেরা বিদায়ের যোগ্য!');
                },
              ),
              ReadSms(
                message: 'তোমাকে বিদায় জানানো সবচেয়ে কঠিন কাজগুলির মধ্যে একটি, কিন্তু তুমি যে নতুন সুযোগ পাচ্ছো তাতে আমরা খুব খুশি। বিদায় সিনিয়র। তুমি সব সেরা জিনিস পাওয়ার যোগ্য।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমাকে বিদায় জানানো সবচেয়ে কঠিন কাজগুলির মধ্যে একটি, কিন্তু তুমি যে নতুন সুযোগ পাচ্ছো তাতে আমরা খুব খুশি। বিদায় সিনিয়র। তুমি সব সেরা জিনিস পাওয়ার যোগ্য।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমাকে বিদায় জানানো সবচেয়ে কঠিন কাজগুলির মধ্যে একটি, কিন্তু তুমি যে নতুন সুযোগ পাচ্ছো তাতে আমরা খুব খুশি। বিদায় সিনিয়র। তুমি সব সেরা জিনিস পাওয়ার যোগ্য।');
                },
              ),
              ReadSms(
                message: 'দীর্ঘমেয়াদে আমাকে অনেক কিছু শেখানোর জন্য ধন্যবাদ। আমি এই সব ভালো স্মৃতি আমার হৃদয়ে ধরে রাখতে চাই এবং সামনের দিকে তাকাতে চাই! বিদায়!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('দীর্ঘমেয়াদে আমাকে অনেক কিছু শেখানোর জন্য ধন্যবাদ। আমি এই সব ভালো স্মৃতি আমার হৃদয়ে ধরে রাখতে চাই এবং সামনের দিকে তাকাতে চাই! বিদায়!');
                },
                copyButton: (){
                  FlutterClipboard.copy('দীর্ঘমেয়াদে আমাকে অনেক কিছু শেখানোর জন্য ধন্যবাদ। আমি এই সব ভালো স্মৃতি আমার হৃদয়ে ধরে রাখতে চাই এবং সামনের দিকে তাকাতে চাই! বিদায়!');
                },
              ),
              ReadSms(
                message: 'তুমি শুধু একজন বন্ধু বা সতীর্থের চেয়েও বেশি কিছু ছিলে - তুমি এমন একজন যার উপর আমি সবসময় নির্ভর করতে পারি। বিদায় জানানো কঠিন, কিন্তু আমি সত্যিই তোমার জন্য খুশি।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তুমি শুধু একজন বন্ধু বা সতীর্থের চেয়েও বেশি কিছু ছিলে - তুমি এমন একজন যার উপর আমি সবসময় নির্ভর করতে পারি। বিদায় জানানো কঠিন, কিন্তু আমি সত্যিই তোমার জন্য খুশি।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তুমি শুধু একজন বন্ধু বা সতীর্থের চেয়েও বেশি কিছু ছিলে - তুমি এমন একজন যার উপর আমি সবসময় নির্ভর করতে পারি। বিদায় জানানো কঠিন, কিন্তু আমি সত্যিই তোমার জন্য খুশি।');
                },
              ),
              ReadSms(
                message: 'তোমার পরবর্তী চাকরিতে তুমি সাফল্য পাও। শুভেচ্ছা এবং বিদায়।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার পরবর্তী চাকরিতে তুমি সাফল্য পাও। শুভেচ্ছা এবং বিদায়।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার পরবর্তী চাকরিতে তুমি সাফল্য পাও। শুভেচ্ছা এবং বিদায়।');
                },
              ),
              ReadSms(
                message: 'বিদায়। তোমার পরবর্তী জীবনযাত্রা তোমার আগের জীবনের মতোই ফলপ্রসূ হোক।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('বিদায়। তোমার পরবর্তী জীবনযাত্রা তোমার আগের জীবনের মতোই ফলপ্রসূ হোক।');
                },
                copyButton: (){
                  FlutterClipboard.copy('বিদায়। তোমার পরবর্তী জীবনযাত্রা তোমার আগের জীবনের মতোই ফলপ্রসূ হোক।');
                },
              ),
              ReadSms(
                message: 'তোমার সাথে কাজ করার অভিজ্ঞতা দারুন ছিল। তোমার ভবিষ্যতের জন্য শুভকামনা!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার সাথে কাজ করার অভিজ্ঞতা দারুন ছিল। তোমার ভবিষ্যতের জন্য শুভকামনা!');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার সাথে কাজ করার অভিজ্ঞতা দারুন ছিল। তোমার ভবিষ্যতের জন্য শুভকামনা!');
                },
              ),
              ReadSms(
                message: 'বিদায়! আমরা যত দূরেই থাকি না কেন, আমাদের বন্ধুত্ব সবসময় এখনকার মতোই দৃঢ় থাকবে।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('বিদায়! আমরা যত দূরেই থাকি না কেন, আমাদের বন্ধুত্ব সবসময় এখনকার মতোই দৃঢ় থাকবে।');
                },
                copyButton: (){
                  FlutterClipboard.copy('বিদায়! আমরা যত দূরেই থাকি না কেন, আমাদের বন্ধুত্ব সবসময় এখনকার মতোই দৃঢ় থাকবে।');
                },
              ),
              ReadSms(
                message: 'শুভকামনা এবং বিদায়, বস। আশা করি ভবিষ্যতে আবার কোনও দিন আপনার সাথে কাজ করব।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('শুভকামনা এবং বিদায়, বস। আশা করি ভবিষ্যতে আবার কোনও দিন আপনার সাথে কাজ করব।');
                },
                copyButton: (){
                  FlutterClipboard.copy('শুভকামনা এবং বিদায়, বস। আশা করি ভবিষ্যতে আবার কোনও দিন আপনার সাথে কাজ করব।');
                },
              ),
              ReadSms(
                message: 'তুমি আমার জীবনের একটা বড় অংশ। সবকিছুর জন্য তোমাকে ধন্যবাদ। তোমার জন্য শুভকামনা।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তুমি আমার জীবনের একটা বড় অংশ। সবকিছুর জন্য তোমাকে ধন্যবাদ। তোমার জন্য শুভকামনা।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তুমি আমার জীবনের একটা বড় অংশ। সবকিছুর জন্য তোমাকে ধন্যবাদ। তোমার জন্য শুভকামনা।');
                },
              ),
              ReadSms(
                message: 'তোমার নতুন যাত্রায় শুভকামনা। আমি তোমার জন্য গর্বিত। সুখী এবং নিরাপদে থেকো।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার নতুন যাত্রায় শুভকামনা। আমি তোমার জন্য গর্বিত। সুখী এবং নিরাপদে থেকো।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার নতুন যাত্রায় শুভকামনা। আমি তোমার জন্য গর্বিত। সুখী এবং নিরাপদে থেকো।');
                },
              ),
              ReadSms(
                message: 'তোমার নতুন যাত্রায় শুভকামনা। আমি তোমার জন্য গর্বিত। সুখী এবং নিরাপদে থেকো।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার নতুন যাত্রায় শুভকামনা। আমি তোমার জন্য গর্বিত। সুখী এবং নিরাপদে থেকো।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার নতুন যাত্রায় শুভকামনা। আমি তোমার জন্য গর্বিত। সুখী এবং নিরাপদে থেকো।');
                },
              ),
              ReadSms(
                message: 'তোমাকে চলে যেতে দেখে খারাপ লাগছে। তোমাকে ছাড়া অফিস আগের মতো থাকবে না। তোমার জন্য শুভকামনা। বিদায়!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমাকে চলে যেতে দেখে খারাপ লাগছে। তোমাকে ছাড়া অফিস আগের মতো থাকবে না। তোমার জন্য শুভকামনা। বিদায়!');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমাকে চলে যেতে দেখে খারাপ লাগছে। তোমাকে ছাড়া অফিস আগের মতো থাকবে না। তোমার জন্য শুভকামনা। বিদায়!');
                },
              ),
              ReadSms(
                message: 'আমার ক্লান্তিকর দিনগুলিকে ভালো করে তোলার জন্য ধন্যবাদ। তুমি একজন সহায়ক এবং দয়ালু সহকর্মী। জীবনের পরবর্তী অধ্যায়ে তুমি সফল হও। বিদায়!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('আমার ক্লান্তিকর দিনগুলিকে ভালো করে তোলার জন্য ধন্যবাদ। তুমি একজন সহায়ক এবং দয়ালু সহকর্মী। জীবনের পরবর্তী অধ্যায়ে তুমি সফল হও। বিদায়!');
                },
                copyButton: (){
                  FlutterClipboard.copy('আমার ক্লান্তিকর দিনগুলিকে ভালো করে তোলার জন্য ধন্যবাদ। তুমি একজন সহায়ক এবং দয়ালু সহকর্মী। জীবনের পরবর্তী অধ্যায়ে তুমি সফল হও। বিদায়!');
                },
              ),
              ReadSms(
                message: 'তোমার উৎসাহ আমাকে সবসময় কঠোর পরিশ্রম করতে অনুপ্রাণিত করেছে। তোমার জন্য আমার ব্যস্ত দিনগুলো মজার ছিল। তোমাকে বিদায় জানানোর সময় এসেছে। তুমি তোমার লক্ষ্য অর্জন করো।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার উৎসাহ আমাকে সবসময় কঠোর পরিশ্রম করতে অনুপ্রাণিত করেছে। তোমার জন্য আমার ব্যস্ত দিনগুলো মজার ছিল। তোমাকে বিদায় জানানোর সময় এসেছে। তুমি তোমার লক্ষ্য অর্জন করো।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার উৎসাহ আমাকে সবসময় কঠোর পরিশ্রম করতে অনুপ্রাণিত করেছে। তোমার জন্য আমার ব্যস্ত দিনগুলো মজার ছিল। তোমাকে বিদায় জানানোর সময় এসেছে। তুমি তোমার লক্ষ্য অর্জন করো।');
                },
              ),
              ReadSms(
                message: 'বিদায়, আমার প্রিয় কর্মজীবনের বন্ধু। তোমার দক্ষতা এবং নিষ্ঠার একটা বিরাট প্রভাব পড়েছে, আর তোমার উপস্থিতির অভাব বোধ করা হবে।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('বিদায়, আমার প্রিয় কর্মজীবনের বন্ধু। তোমার দক্ষতা এবং নিষ্ঠার একটা বিরাট প্রভাব পড়েছে, আর তোমার উপস্থিতির অভাব বোধ করা হবে।');
                },
                copyButton: (){
                  FlutterClipboard.copy('বিদায়, আমার প্রিয় কর্মজীবনের বন্ধু। তোমার দক্ষতা এবং নিষ্ঠার একটা বিরাট প্রভাব পড়েছে, আর তোমার উপস্থিতির অভাব বোধ করা হবে।');
                },
              ),
              ReadSms(
                message: 'আপনাকে আমাদের পরামর্শদাতা এবং বস হিসেবে পেয়ে আমরা সৌভাগ্যবান। আপনাকে বিদায়। শুভকামনা।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('আপনাকে আমাদের পরামর্শদাতা এবং বস হিসেবে পেয়ে আমরা সৌভাগ্যবান। আপনাকে বিদায়। শুভকামনা।');
                },
                copyButton: (){
                  FlutterClipboard.copy('আপনাকে আমাদের পরামর্শদাতা এবং বস হিসেবে পেয়ে আমরা সৌভাগ্যবান। আপনাকে বিদায়। শুভকামনা।');
                },
              ),
              ReadSms(
                message: 'আমরা আমাদের কোম্পানির সেরা নেতাকে মিস করব। তত্ত্বাবধানে থাকাটা দারুন ছিল। আপনি বন্ধুসুলভ, নিবেদিতপ্রাণ এবং একজন নিখুঁত নেতার সত্যিকারের উদাহরণ। বিদায় বস!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('আমরা আমাদের কোম্পানির সেরা নেতাকে মিস করব। তত্ত্বাবধানে থাকাটা দারুন ছিল। আপনি বন্ধুসুলভ, নিবেদিতপ্রাণ এবং একজন নিখুঁত নেতার সত্যিকারের উদাহরণ। বিদায় বস!');
                },
                copyButton: (){
                  FlutterClipboard.copy('আমরা আমাদের কোম্পানির সেরা নেতাকে মিস করব। তত্ত্বাবধানে থাকাটা দারুন ছিল। আপনি বন্ধুসুলভ, নিবেদিতপ্রাণ এবং একজন নিখুঁত নেতার সত্যিকারের উদাহরণ। বিদায় বস!');
                },
              ),
              ReadSms(
                message: 'তুমি আমাদের নিজেদের উপর বিশ্বাস জাগিয়ে তুলেছ। তোমার চেয়ে আর কেউ আমাদেরকে এতটা সফলভাবে গাইড করতে পারেনি। আমাদের জন্য তোমাকে বিদায় জানানো কঠিন। কিন্তু তোমার অভাব অবশ্যই থাকবে!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তুমি আমাদের নিজেদের উপর বিশ্বাস জাগিয়ে তুলেছ। তোমার চেয়ে আর কেউ আমাদেরকে এতটা সফলভাবে গাইড করতে পারেনি। আমাদের জন্য তোমাকে বিদায় জানানো কঠিন। কিন্তু তোমার অভাব অবশ্যই থাকবে!');
                },
                copyButton: (){
                  FlutterClipboard.copy('তুমি আমাদের নিজেদের উপর বিশ্বাস জাগিয়ে তুলেছ। তোমার চেয়ে আর কেউ আমাদেরকে এতটা সফলভাবে গাইড করতে পারেনি। আমাদের জন্য তোমাকে বিদায় জানানো কঠিন। কিন্তু তোমার অভাব অবশ্যই থাকবে!');
                },
              ),
              ReadSms(
                message: 'আপনাকে আমাদের পরামর্শদাতা এবং বস হিসেবে পেয়ে আমরা সৌভাগ্যবান। আপনাকে বিদায়। শুভকামনা।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('আপনাকে আমাদের পরামর্শদাতা এবং বস হিসেবে পেয়ে আমরা সৌভাগ্যবান। আপনাকে বিদায়। শুভকামনা।');
                },
                copyButton: (){
                  FlutterClipboard.copy('আপনাকে আমাদের পরামর্শদাতা এবং বস হিসেবে পেয়ে আমরা সৌভাগ্যবান। আপনাকে বিদায়। শুভকামনা।');
                },
              ),
              ReadSms(
                message: 'বিদায়, আমার প্রিয় কর্মজীবনের বন্ধু। তোমার দক্ষতা এবং নিষ্ঠা উল্লেখযোগ্য প্রভাব ফেলেছে, এবং তোমার উপস্থিতির অভাব বোধ করা হবে।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('বিদায়, আমার প্রিয় কর্মজীবনের বন্ধু। তোমার দক্ষতা এবং নিষ্ঠা উল্লেখযোগ্য প্রভাব ফেলেছে, এবং তোমার উপস্থিতির অভাব বোধ করা হবে।');
                },
                copyButton: (){
                  FlutterClipboard.copy('বিদায়, আমার প্রিয় কর্মজীবনের বন্ধু। তোমার দক্ষতা এবং নিষ্ঠা উল্লেখযোগ্য প্রভাব ফেলেছে, এবং তোমার উপস্থিতির অভাব বোধ করা হবে।');
                },
              ),
              ReadSms(
                message: 'আপনার মতো অভিজ্ঞ সিনিয়রের সাথে কাজ করা আমার জন্য এক উপহার। আপনার নীতিবোধ এবং মনোভাব সবসময়ই আমার কাছে প্রশংসিত। বিদায়, স্যার।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('আপনার মতো অভিজ্ঞ সিনিয়রের সাথে কাজ করা আমার জন্য এক উপহার। আপনার নীতিবোধ এবং মনোভাব সবসময়ই আমার কাছে প্রশংসিত। বিদায়, স্যার।');
                },
                copyButton: (){
                  FlutterClipboard.copy('আপনার মতো অভিজ্ঞ সিনিয়রের সাথে কাজ করা আমার জন্য এক উপহার। আপনার নীতিবোধ এবং মনোভাব সবসময়ই আমার কাছে প্রশংসিত। বিদায়, স্যার।');
                },
              ),
              ReadSms(
                message: 'আমি ভাগ্যবান যে এত ভালো এবং বোধগম্য একজন সিনিয়র সহকর্মী পেয়েছি। তোমাকে এবং তোমার নেতৃত্বকে মিস করব। শুভ অবসর।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('আমি ভাগ্যবান যে এত ভালো এবং বোধগম্য একজন সিনিয়র সহকর্মী পেয়েছি। তোমাকে এবং তোমার নেতৃত্বকে মিস করব। শুভ অবসর।');
                },
                copyButton: (){
                  FlutterClipboard.copy('আমি ভাগ্যবান যে এত ভালো এবং বোধগম্য একজন সিনিয়র সহকর্মী পেয়েছি। তোমাকে এবং তোমার নেতৃত্বকে মিস করব। শুভ অবসর।');
                },
              ),
              ReadSms(
                message: 'আপনার কাছ থেকে আমরা অনেক কিছু শিখেছি, সিনিয়র। আপনার সাথে কাজ করা সম্মানের ছিল। বিদায়।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('আপনার কাছ থেকে আমরা অনেক কিছু শিখেছি, সিনিয়র। আপনার সাথে কাজ করা সম্মানের ছিল। বিদায়।');
                },
                copyButton: (){
                  FlutterClipboard.copy('আপনার কাছ থেকে আমরা অনেক কিছু শিখেছি, সিনিয়র। আপনার সাথে কাজ করা সম্মানের ছিল। বিদায়।');
                },
              ),
              ReadSms(
                message: 'তোমার সাথে কাজ করার অভিজ্ঞতা অসাধারণ ছিল। আমি আশা করি তুমি যেখানেই যাও না কেন, সাফল্য তোমাকে খুঁজে পাবে। শুভকামনা!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার সাথে কাজ করার অভিজ্ঞতা অসাধারণ ছিল। আমি আশা করি তুমি যেখানেই যাও না কেন, সাফল্য তোমাকে খুঁজে পাবে। শুভকামনা!');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার সাথে কাজ করার অভিজ্ঞতা অসাধারণ ছিল। আমি আশা করি তুমি যেখানেই যাও না কেন, সাফল্য তোমাকে খুঁজে পাবে। শুভকামনা!');
                },
              ),
              ReadSms(
                message: 'তোমার নতুন জুনিয়রদের দেখে আমি ঈর্ষা করি, যারা তোমার জ্ঞান থেকে উপকৃত হওয়ার সুযোগ পাবে। কিন্তু তোমার উত্তরাধিকার বেঁচে থাকবে জেনে আমি খুশি। বিদায়!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার নতুন জুনিয়রদের দেখে আমি ঈর্ষা করি, যারা তোমার জ্ঞান থেকে উপকৃত হওয়ার সুযোগ পাবে। কিন্তু তোমার উত্তরাধিকার বেঁচে থাকবে জেনে আমি খুশি। বিদায়!');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার নতুন জুনিয়রদের দেখে আমি ঈর্ষা করি, যারা তোমার জ্ঞান থেকে উপকৃত হওয়ার সুযোগ পাবে। কিন্তু তোমার উত্তরাধিকার বেঁচে থাকবে জেনে আমি খুশি। বিদায়!');
                },
              ),
              ReadSms(
                message: 'তোমার জীবনের এই নতুন শুরুর জন্য শুভেচ্ছা! আমি বিশ্বাস করি তুমি যা স্বপ্ন দেখো তা অর্জন করবে। বিদায়!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার জীবনের এই নতুন শুরুর জন্য শুভেচ্ছা! আমি বিশ্বাস করি তুমি যা স্বপ্ন দেখো তা অর্জন করবে। বিদায়!');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার জীবনের এই নতুন শুরুর জন্য শুভেচ্ছা! আমি বিশ্বাস করি তুমি যা স্বপ্ন দেখো তা অর্জন করবে। বিদায়!');
                },
              ),
              ReadSms(
                message: 'ঈশ্বর তোমার স্বপ্ন পূরণে তোমার আশীর্বাদ করুন। আশা করি তুমি সবসময় নিজের প্রতি সৎ থাকবে এবং সবাইকে গর্বিত করবে! বিদায়!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('ঈশ্বর তোমার স্বপ্ন পূরণে তোমার আশীর্বাদ করুন। আশা করি তুমি সবসময় নিজের প্রতি সৎ থাকবে এবং সবাইকে গর্বিত করবে! বিদায়!');
                },
                copyButton: (){
                  FlutterClipboard.copy('ঈশ্বর তোমার স্বপ্ন পূরণে তোমার আশীর্বাদ করুন। আশা করি তুমি সবসময় নিজের প্রতি সৎ থাকবে এবং সবাইকে গর্বিত করবে! বিদায়!');
                },
              ),
              ReadSms(
                message: 'তোমার এবং তোমার পুরনো অধ্যায়ের বিদায়। এই নতুন সূচনা তোমার জন্য আনন্দ, সাফল্য এবং শান্তি বয়ে আনুক।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার এবং তোমার পুরনো অধ্যায়ের বিদায়। এই নতুন সূচনা তোমার জন্য আনন্দ, সাফল্য এবং শান্তি বয়ে আনুক।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার এবং তোমার পুরনো অধ্যায়ের বিদায়। এই নতুন সূচনা তোমার জন্য আনন্দ, সাফল্য এবং শান্তি বয়ে আনুক।');
                },
              ),
              ReadSms(
                message: 'পরবর্তী অধ্যায়ে তোমার উত্তরণ মাখনের মতো মসৃণ হোক। বিদায়, এবং নতুন সবকিছুর জন্য শুভকামনা!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('পরবর্তী অধ্যায়ে তোমার উত্তরণ মাখনের মতো মসৃণ হোক। বিদায়, এবং নতুন সবকিছুর জন্য শুভকামনা!');
                },
                copyButton: (){
                  FlutterClipboard.copy('পরবর্তী অধ্যায়ে তোমার উত্তরণ মাখনের মতো মসৃণ হোক। বিদায়, এবং নতুন সবকিছুর জন্য শুভকামনা!');
                },
              ),
              ReadSms(
                message: 'তোমার নতুন জীবনের প্রতিটি সূর্যোদয়ে শান্তি এবং প্রতিটি সূর্যাস্তে আনন্দ কামনা করছি। আমার সমস্ত হৃদয় দিয়ে বিদায়।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার নতুন জীবনের প্রতিটি সূর্যোদয়ে শান্তি এবং প্রতিটি সূর্যাস্তে আনন্দ কামনা করছি। আমার সমস্ত হৃদয় দিয়ে বিদায়।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার নতুন জীবনের প্রতিটি সূর্যোদয়ে শান্তি এবং প্রতিটি সূর্যাস্তে আনন্দ কামনা করছি। আমার সমস্ত হৃদয় দিয়ে বিদায়।');
                },
              ),
              ReadSms(
                message: 'এগিয়ে যান এবং আপনার গৌরব খুঁজে বের করুন। কিন্তু যাদের সাথে আপনি যাত্রা ভাগ করে নিয়েছেন তাদের কখনও ভুলবেন না। নতুন জীবনের জন্য শুভকামনা!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('এগিয়ে যান এবং আপনার গৌরব খুঁজে বের করুন। কিন্তু যাদের সাথে আপনি যাত্রা ভাগ করে নিয়েছেন তাদের কখনও ভুলবেন না। নতুন জীবনের জন্য শুভকামনা!');
                },
                copyButton: (){
                  FlutterClipboard.copy('এগিয়ে যান এবং আপনার গৌরব খুঁজে বের করুন। কিন্তু যাদের সাথে আপনি যাত্রা ভাগ করে নিয়েছেন তাদের কখনও ভুলবেন না। নতুন জীবনের জন্য শুভকামনা!');
                },
              ),
              ReadSms(
                message: 'তুমি নতুন শুরুর জন্য আরাম রেখে যাচ্ছ। বিদায়! তোমার সাহস তোমাকে অসাধারণ কিছুর দিকে নিয়ে যাক।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তুমি নতুন শুরুর জন্য আরাম রেখে যাচ্ছ। বিদায়! তোমার সাহস তোমাকে অসাধারণ কিছুর দিকে নিয়ে যাক।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তুমি নতুন শুরুর জন্য আরাম রেখে যাচ্ছ। বিদায়! তোমার সাহস তোমাকে অসাধারণ কিছুর দিকে নিয়ে যাক।');
                },
              ),
              ReadSms(
                message: 'নতুন কিছুতে পা রাখার জন্য তোমাদের সকলের শুভকামনা। বিদায়, এবং তোমাদের যাত্রা আলো এবং প্রবৃদ্ধিতে পূর্ণ হোক।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('নতুন কিছুতে পা রাখার জন্য তোমাদের সকলের শুভকামনা। বিদায়, এবং তোমাদের যাত্রা আলো এবং প্রবৃদ্ধিতে পূর্ণ হোক।');
                },
                copyButton: (){
                  FlutterClipboard.copy('নতুন কিছুতে পা রাখার জন্য তোমাদের সকলের শুভকামনা। বিদায়, এবং তোমাদের যাত্রা আলো এবং প্রবৃদ্ধিতে পূর্ণ হোক।');
                },
              ),
              ReadSms(
                message: 'প্রতিটি শেষই একটি নতুন শুরু নিয়ে আসে। বিদায় প্রিয়, এবং তোমার ভবিষ্যৎ উজ্জ্বল এবং তোমার জন্য সদয় হোক।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('প্রতিটি শেষই একটি নতুন শুরু নিয়ে আসে। বিদায় প্রিয়, এবং তোমার ভবিষ্যৎ উজ্জ্বল এবং তোমার জন্য সদয় হোক।');
                },
                copyButton: (){
                  FlutterClipboard.copy('প্রতিটি শেষই একটি নতুন শুরু নিয়ে আসে। বিদায় প্রিয়, এবং তোমার ভবিষ্যৎ উজ্জ্বল এবং তোমার জন্য সদয় হোক।');
                },
              ),
              ReadSms(
                message: 'বিদায় জানানো কঠিন, কিন্তু আমি জানি এই পরিবর্তন তোমার জন্য আরও ভালো কিছু বয়ে আনবে। তোমার জন্য শুভকামনা।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('বিদায় জানানো কঠিন, কিন্তু আমি জানি এই পরিবর্তন তোমার জন্য আরও ভালো কিছু বয়ে আনবে। তোমার জন্য শুভকামনা।');
                },
                copyButton: (){
                  FlutterClipboard.copy('বিদায় জানানো কঠিন, কিন্তু আমি জানি এই পরিবর্তন তোমার জন্য আরও ভালো কিছু বয়ে আনবে। তোমার জন্য শুভকামনা।');
                },
              ),
              ReadSms(
                message: 'বিদায় মানে আমাদের বন্ধুত্বের সমাপ্তি নয়। আমরা একসাথে দারুন এক যাত্রা করেছি এবং শেষ পর্যন্ত অবশ্যই আমরা একে অপরের সাথে দেখা করব!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('বিদায় মানে আমাদের বন্ধুত্বের সমাপ্তি নয়। আমরা একসাথে দারুন এক যাত্রা করেছি এবং শেষ পর্যন্ত অবশ্যই আমরা একে অপরের সাথে দেখা করব!');
                },
                copyButton: (){
                  FlutterClipboard.copy('বিদায় মানে আমাদের বন্ধুত্বের সমাপ্তি নয়। আমরা একসাথে দারুন এক যাত্রা করেছি এবং শেষ পর্যন্ত অবশ্যই আমরা একে অপরের সাথে দেখা করব!');
                },
              ),
              ReadSms(
                message: 'আমি তোমাকে মিস করব, কিন্তু তোমার নতুন অভিযানের জন্য আমি উত্তেজিত। তুমি যেখানেই যাও না কেন, তোমার একজন বন্ধু তোমার সাফল্যের জন্য উল্লাস করছে।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('আমি তোমাকে মিস করব, কিন্তু তোমার নতুন অভিযানের জন্য আমি উত্তেজিত। তুমি যেখানেই যাও না কেন, তোমার একজন বন্ধু তোমার সাফল্যের জন্য উল্লাস করছে।');
                },
                copyButton: (){
                  FlutterClipboard.copy('আমি তোমাকে মিস করব, কিন্তু তোমার নতুন অভিযানের জন্য আমি উত্তেজিত। তুমি যেখানেই যাও না কেন, তোমার একজন বন্ধু তোমার সাফল্যের জন্য উল্লাস করছে।');
                },
              ),
              ReadSms(
                message: 'বন্ধুরা কখনো একে অপরকে বিদায় জানায় না। কারণ, হৃদয়ের গভীরে, তারা জানে যে তারা চিরকাল যোগাযোগ রাখবে! তোমার ভবিষ্যতের জন্য শুভকামনা!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('বন্ধুরা কখনো একে অপরকে বিদায় জানায় না। কারণ, হৃদয়ের গভীরে, তারা জানে যে তারা চিরকাল যোগাযোগ রাখবে! তোমার ভবিষ্যতের জন্য শুভকামনা!');
                },
                copyButton: (){
                  FlutterClipboard.copy('বন্ধুরা কখনো একে অপরকে বিদায় জানায় না। কারণ, হৃদয়ের গভীরে, তারা জানে যে তারা চিরকাল যোগাযোগ রাখবে! তোমার ভবিষ্যতের জন্য শুভকামনা!');
                },
              ),
              ReadSms(
                message: 'বিদায় জানানো আমার পক্ষে সহজ নয়, তবে আমি সবসময় তোমার জন্য সর্বোত্তমটা চাইব! তোমার জীবন তোমার জন্য সহজ হোক। আমি তোমাকে মিস করব, প্রিয় বন্ধু!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('বিদায় জানানো আমার পক্ষে সহজ নয়, তবে আমি সবসময় তোমার জন্য সর্বোত্তমটা চাইব! তোমার জীবন তোমার জন্য সহজ হোক। আমি তোমাকে মিস করব, প্রিয় বন্ধু!');
                },
                copyButton: (){
                  FlutterClipboard.copy('বিদায় জানানো আমার পক্ষে সহজ নয়, তবে আমি সবসময় তোমার জন্য সর্বোত্তমটা চাইব! তোমার জীবন তোমার জন্য সহজ হোক। আমি তোমাকে মিস করব, প্রিয় বন্ধু!');
                },
              ),
              ReadSms(
                message: 'প্রিয় বন্ধু, তোমার আগামী জীবনের জন্য শুভকামনা। আবার দেখা না হওয়া পর্যন্ত!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('প্রিয় বন্ধু, তোমার আগামী জীবনের জন্য শুভকামনা। আবার দেখা না হওয়া পর্যন্ত!');
                },
                copyButton: (){
                  FlutterClipboard.copy('প্রিয় বন্ধু, তোমার আগামী জীবনের জন্য শুভকামনা। আবার দেখা না হওয়া পর্যন্ত!');
                },
              ),
              ReadSms(
                message: 'তোমার নতুন যাত্রার জন্য শুভকামনা। তুমি যেখানেই যাও না কেন, তুমি সবসময় আমার জীবনের একটি গুরুত্বপূর্ণ অংশ হয়ে থাকবে। বিদায়, বন্ধু। আশা করি তুমি তোমার নতুন জীবনে অসাধারণ কিছু করবে।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার নতুন যাত্রার জন্য শুভকামনা। তুমি যেখানেই যাও না কেন, তুমি সবসময় আমার জীবনের একটি গুরুত্বপূর্ণ অংশ হয়ে থাকবে। বিদায়, বন্ধু। আশা করি তুমি তোমার নতুন জীবনে অসাধারণ কিছু করবে।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার নতুন যাত্রার জন্য শুভকামনা। তুমি যেখানেই যাও না কেন, তুমি সবসময় আমার জীবনের একটি গুরুত্বপূর্ণ অংশ হয়ে থাকবে। বিদায়, বন্ধু। আশা করি তুমি তোমার নতুন জীবনে অসাধারণ কিছু করবে।');
                },
              ),
              ReadSms(
                message: 'তোমার মতো একজন সত্যিকারের বন্ধু জীবনের জন্য এক মূল্যবান উপহার। আজ আমার হৃদয় কেঁদে উঠছে জেনে যে তুমি আর আমার সাথে থাকবে না। নতুন জীবন সুখের হোক!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমার মতো একজন সত্যিকারের বন্ধু জীবনের জন্য এক মূল্যবান উপহার। আজ আমার হৃদয় কেঁদে উঠছে জেনে যে তুমি আর আমার সাথে থাকবে না। নতুন জীবন সুখের হোক!');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমার মতো একজন সত্যিকারের বন্ধু জীবনের জন্য এক মূল্যবান উপহার। আজ আমার হৃদয় কেঁদে উঠছে জেনে যে তুমি আর আমার সাথে থাকবে না। নতুন জীবন সুখের হোক!');
                },
              ),
              ReadSms(
                message: 'পৃথিবী ভাগ্যবান যে তোমার মতো অসাধারণ কাউকে পেয়েছে। বিদায়, আমার বন্ধু, যতক্ষণ না আমাদের পথ আবার মিলিত হয়।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('পৃথিবী ভাগ্যবান যে তোমার মতো অসাধারণ কাউকে পেয়েছে। বিদায়, আমার বন্ধু, যতক্ষণ না আমাদের পথ আবার মিলিত হয়।');
                },
                copyButton: (){
                  FlutterClipboard.copy('পৃথিবী ভাগ্যবান যে তোমার মতো অসাধারণ কাউকে পেয়েছে। বিদায়, আমার বন্ধু, যতক্ষণ না আমাদের পথ আবার মিলিত হয়।');
                },
              ),
              ReadSms(
                message: 'তোমাকে বিদায় জানাতে আমার হৃদয় কেঁদে উঠছে, কিন্তু তোমার জীবনের নতুন শুরুর জন্য এটি খুশি। শুভকামনা।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমাকে বিদায় জানাতে আমার হৃদয় কেঁদে উঠছে, কিন্তু তোমার জীবনের নতুন শুরুর জন্য এটি খুশি। শুভকামনা।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমাকে বিদায় জানাতে আমার হৃদয় কেঁদে উঠছে, কিন্তু তোমার জীবনের নতুন শুরুর জন্য এটি খুশি। শুভকামনা।');
                },
              ),
              ReadSms(
                message: 'বিদায় জানানো জীবনেরই অংশ। আসুন দুঃখ না করি। আসুন ভালো স্মৃতিগুলো ধরে রাখি এবং একটি সুখী ভবিষ্যতের দিকে তাকাই। নিজের যত্ন নিও। বিদায়!',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('বিদায় জানানো জীবনেরই অংশ। আসুন দুঃখ না করি। আসুন ভালো স্মৃতিগুলো ধরে রাখি এবং একটি সুখী ভবিষ্যতের দিকে তাকাই। নিজের যত্ন নিও। বিদায়!');
                },
                copyButton: (){
                  FlutterClipboard.copy('বিদায় জানানো জীবনেরই অংশ। আসুন দুঃখ না করি। আসুন ভালো স্মৃতিগুলো ধরে রাখি এবং একটি সুখী ভবিষ্যতের দিকে তাকাই। নিজের যত্ন নিও। বিদায়!');
                },
              ),
              ReadSms(
                message: 'তোমাকে বেড়ে উঠতে দেখাটা আমার জন্য একটা উপহার। বিদায়, আর তোমার সামনের পথ আলোয় পূর্ণ হোক।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('তোমাকে বেড়ে উঠতে দেখাটা আমার জন্য একটা উপহার। বিদায়, আর তোমার সামনের পথ আলোয় পূর্ণ হোক।');
                },
                copyButton: (){
                  FlutterClipboard.copy('তোমাকে বেড়ে উঠতে দেখাটা আমার জন্য একটা উপহার। বিদায়, আর তোমার সামনের পথ আলোয় পূর্ণ হোক।');
                },
              ),
              ReadSms(
                message: 'বিদায়, বাবা। তুমি যা করেছো তার জন্য আমি গর্বিত। তোমার পরবর্তী পদক্ষেপ উপভোগ করো এবং নিজের যত্ন নিও।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('বিদায়, বাবা। তুমি যা করেছো তার জন্য আমি গর্বিত। তোমার পরবর্তী পদক্ষেপ উপভোগ করো এবং নিজের যত্ন নিও।');
                },
                copyButton: (){
                  FlutterClipboard.copy('বিদায়, বাবা। তুমি যা করেছো তার জন্য আমি গর্বিত। তোমার পরবর্তী পদক্ষেপ উপভোগ করো এবং নিজের যত্ন নিও।');
                },
              ),
              ReadSms(
                message: 'প্রিয় মা, তোমার শক্তি এবং ভালোবাসার আমি প্রশংসা করি। নতুন অধ্যায়ে প্রবেশের জন্য বিদায় এবং শুভেচ্ছা।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('প্রিয় মা, তোমার শক্তি এবং ভালোবাসার আমি প্রশংসা করি। নতুন অধ্যায়ে প্রবেশের জন্য বিদায় এবং শুভেচ্ছা।');
                },
                copyButton: (){
                  FlutterClipboard.copy('প্রিয় মা, তোমার শক্তি এবং ভালোবাসার আমি প্রশংসা করি। নতুন অধ্যায়ে প্রবেশের জন্য বিদায় এবং শুভেচ্ছা।');
                },
              ),
              ReadSms(
                message: 'বিদায়, প্রিয়তমা। তোমার কঠোর পরিশ্রম আমাকে সবসময় অবাক করেছে। এই নতুন যাত্রায় তোমার শুভকামনা।',
                favoriteButton: () {},
                shareButton: () {
                  Share.share('বিদায়, প্রিয়তমা। তোমার কঠোর পরিশ্রম আমাকে সবসময় অবাক করেছে। এই নতুন যাত্রায় তোমার শুভকামনা।');
                },
                copyButton: (){
                  FlutterClipboard.copy('বিদায়, প্রিয়তমা। তোমার কঠোর পরিশ্রম আমাকে সবসময় অবাক করেছে। এই নতুন যাত্রায় তোমার শুভকামনা।');
                },
              ),
            ],
          ),
          SizedBox(height: 30),
        ],
      ),
    );
  }
}